{
  "backend/main.mo": "Motoko actor combining access control, user approval, and profile storage with admin/user permission checks for approval and profile actions.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for build and feature tracking purposes.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook explaining how to retry deployments, including steps, common issues, and troubleshooting guidance.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app component handling session-based routing for login, admin panel, and user dashboard with theme and toast providers.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable gradient action tile component with size variants and icon/label display for dashboards.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Centralized Tailwind class constants for consistent KPI and dashboard border styling.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Configurable confirmation dialog using alert-dialog components with customizable text and variants.",
  "frontend/src/components/feedback/notify.ts": "Helper wrapper for Sonner toast notifications with success, error, and info shorthand functions.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app in a shell with header, logout button, footer, and a logout confirmation dialog.",
  "frontend/src/components/layout/BottomSheet.tsx": "Provides a mobile-style bottom sheet with backdrop, close button, and scroll-locked body behavior.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Renders settings and support/chat buttons for the dashboard footer.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Centers content inside a framed mobile-style container with a fixed full-height layout.",
  "frontend/src/components/layout/PopupModal.tsx": "Displays a fullscreen modal with backdrop, close button, and scroll-locked content.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin panel managing active views, logout flow, and rendering dashboard sections within a frame.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for switching between admin views with icons and labels.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid-based menu mapping admin views to action tiles with icons, gradients, and navigation handlers.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Layout wrapper for admin subpages with fixed header, optional back button, content container, and footer.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines AdminView type, navigation item interface, and the list of admin navigation items.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account data and displays KPI-style summary cards for income, expense, and due amounts.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user registrations, allowing approval with duplicate checks and initializing accounts, or rejecting requests.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Handles adding company financial reports and displaying sorted taken and due report history.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Loads workers and account data to display each worker’s bill, cost, and final balance.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Allows recording shared snack expenses, updates worker cost balances, and manages deletions from history.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Records payment or loan entries split across workers, updates account costs, and supports deleting past entries.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Adds production entries with quantities and rates, updates workers’ bill totals, and supports history deletion.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Thin wrapper that renders the SystemSettingsSection component.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Renders system settings tabs for branding, labels, notices, admin settings, and section configuration.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Wraps and displays the ApprovalsSection for handling user approval requests.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Allows adding, removing, and configuring workers and their single/double rates with persistent storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Manages worker job entries, calculates amounts using stored rates, updates accounts, and maintains editable work history.",
  "frontend/src/features/auth/LoginView.tsx": "Handles user login with branding visuals, input validation, error handling, and optional navigation to registration.",
  "frontend/src/features/auth/RegisterView.tsx": "Processes new user registration requests, checks for duplicates, assigns IDs, stores pending requests, and transitions back to login.",
  "frontend/src/features/support/SupportView.tsx": "Displays support messaging for users and admins, loading threads and allowing sending messages. Admins can view all threads while users see only their own thread.",
  "frontend/src/features/user/components/ClockCard.tsx": "Shows a live digital clock and date, updating every second. Renders time in 12-hour format with styled UI.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Displays KPI summary cards showing total due, total work, and total cost. Uses dashboard overrides for customizable labels.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays the user's nasta expense history with total calculation. Filters entries by user involvement and shows loading and empty states.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Displays user loan/payment history filtered from stored records, showing per-entry amounts and totals. Supports loading state and back navigation.",
  "frontend/src/features/user/production/productionAggregates.ts": "Aggregates stored production entries by worker, initializing all workers and summing their totals.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Shows production summaries aggregated by worker, including totals for double, single, and earnings. Also displays grand totals across all workers.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Normalizes a work entry's worker name fields into a fallback-safe array of names.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "Profile settings page allowing photo upload, name editing, and password changes using session data and local storage.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard handling navigation between views such as production, work, payment, nasta, profile, and support. Loads user stats and profile data and manages logout and modal rendering.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Loads and displays a user's filtered work history with totals for single, double, and earnings.",
  "frontend/src/features/work/workAmount.ts": "Computes per-user or group total amounts for work entries using details or fallback rate data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useBranding.ts": "Reads, listens for updates to, and updates branding settings stored locally.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads and reacts to dashboard override updates, providing a helper for fetching override labels.",
  "frontend/src/hooks/useHashRoute.ts": "Implements simple hash-based routing with state updates on hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity state, login, and logout handling using AuthClient with persisted identity.",
  "frontend/src/hooks/useUserNotice.ts": "Loads and listens for changes to user notice configuration from local storage.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, utility classes, gradients, animations, and accessibility styles.",
  "frontend/src/lib/branding/brandingStorage.ts": "Handles saving/loading branding settings from localStorage and provides fallback logo URLs.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Stores, retrieves, validates, and updates admin username/password using safe storage helpers.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages CRUD operations for company report entries in localStorage.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Stores dashboard label overrides and dispatches update events for live UI changes.",
  "frontend/src/lib/storage/noticeStorage.ts": "Loads and saves scrolling notice configuration for user dashboards.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for localStorage with JSON parsing and array normalization utilities.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures storage schema versioning by clearing legacy keys and marking migration completion.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Maintains support message threads, allowing adding messages and retrieving per-user threads.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and maintains stable auto-generated user IDs for approved users and retrieves IDs.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes per-user profile photo data URLs in localStorage.",
  "frontend/src/main.tsx": "Bootstraps React app with query client and identity provider, loading global styles.",
  "frontend/src/state/session/SessionProvider.tsx": "Manages session state, login/logout logic, user ID assignment, and profile updates.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript interfaces for session state, login results, users, and requests.",
  "frontend/src/state/session/useSession.ts": "Provides a hook to access the session context with required provider enforcement.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend with extended design tokens.",
  "project_state.json": "Stores project metadata, current feature implementations, issues, and pending enhancement requests for UI and production workflows."
}