{
  "backend/main.mo": "Actor handling access control, user approval workflows, and simple user profile storage with permission‑checked CRUD endpoints.",
  "feature_evidence.json": "Feature evidence report listing dashboard layout changes, related files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across auth, admin, user, state, and utility modules.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying base styles for the app.",
  "frontend/index.html": "Base HTML entry file mounting the root element and loading the main React bundle.",
  "frontend/src/App.tsx": "Root React component switching between login, admin panel, and user dashboard based on session state.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable gradient action tile component with size variants for admin, user, and small layouts.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Generic confirm dialog component built with alert‑dialog primitives and customizable actions.",
  "frontend/src/components/feedback/notify.ts": "Sonner-based toast helper providing success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Admin layout shell with header, footer, logout confirmation, and branding elements.",
  "frontend/src/components/layout/DashboardFooter.tsx": "User dashboard footer with support/chat button styled in green gradient.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Frame wrapper giving dashboards a bordered, rounded container with fixed viewport height.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin view component managing active section, logout dialog, and rendering dashboard or section shells.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for admin views with icons and active-state styling.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Three‑group grid menu of admin shortcuts using ActionTile items to navigate to different views.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Layout wrapper providing a fixed header, scrollable content area, and footer for admin subpages.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines AdminView type and navigation item metadata for admin routing.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Displays dynamic income, expense, and due summary cards loaded from local storage.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Handles pending user approvals, updates approved users and workers, and manages related storage updates.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Form and tables for adding and viewing company financial reports stored by type.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Displays final balance table by loading workers and account totals from storage.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Manages snack expense entries, updates per‑person costs, and maintains nasta history and account deductions.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles loan/payment entries, splitting amounts among workers and updating account cost history.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Adds production entries, calculates totals, updates worker bill amounts, and manages production history.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper component rendering system settings UI.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Allows updating branding settings, including company info and logo upload, using tabs UI.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Renders the approvals section for managing user requests.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Manages worker list and rate settings with local storage, allowing add, edit, and delete actions with UI forms and tables.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Records work entries using worker rates, updates individual bills, and maintains work history.",
  "frontend/src/features/auth/LoginView.tsx": "Provides the login form, validation, branding display, and handles session login flow with error states.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles user registration requests, checks duplicates in pending and approved lists, and stores new pending registrations.",
  "frontend/src/features/support/SupportView.tsx": "Implements a support messaging interface for users and admins, loading threads, displaying messages, and sending replies.",
  "frontend/src/features/user/components/ClockCard.tsx": "Displays a live-updating digital clock with formatted date and time.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Shows summary cards for total due, total work, and total cost with styled KPI components.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Loads and displays a user's combined payment and nasta history from local storage, filtering by username and showing totals.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Fetches and shows board work production records for the logged‑in user, including totals for bodies and amount.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Formats worker names for display, falling back to 'Unknown worker' when missing.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "Provides UI for updating profile photo, mobile number, and password with dialogs and validation.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard that switches between views, loads user account totals, and supports logout and navigation.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Displays the user's work history and computes their individual earnings using work details or rate-based fallback.",
  "frontend/src/features/work/workAmount.ts": "Calculates per-user or group totals for work entries using detailed bills when available or stored rate data as fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBranding.ts": "Handles reactive branding settings by reading storage and listening for update events.",
  "frontend/src/hooks/useHashRoute.ts": "Manages simple hash‑based routing with state updates on hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and status tracking. Wraps AuthClient setup and exposes identity state to the app.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, theme variables, gradients, and utility classes for consistent UI styling. Adds custom color palette and layout utilities.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages brand settings in localStorage, merging defaults with stored values and emitting update events. Provides access to logo URLs and branding attributes.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Stores and retrieves company report entries in localStorage with CRUD helpers. Supports filtering reports by type.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers around localStorage operations with JSON handling and fallback behavior. Includes helpers for reliably loading arrays and validating structures.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures a consistent storage schema by clearing legacy keys and marking the current version. Runs once to migrate old data formats.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support message threads in localStorage, allowing adding messages and retrieving user-specific threads. Maintains timestamped conversation history.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes user profile photos in localStorage using a prefixed key. Handles data URL–based photo storage.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider. Mounts the main App component.",
  "frontend/src/state/session/SessionProvider.tsx": "Manages user sessions with admin and user login logic, storage schema initialization, and session persistence via localStorage. Provides profile update and session state through context.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript interfaces for session data, login results, user profiles, and pending requests. Structures the contract for session-related context operations.",
  "frontend/src/state/session/useSession.ts": "Convenience hook for accessing SessionContext, enforcing provider usage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing UI redesign requirements, shared layout goals, and existing feature specifications."
}