{
  "backend/main.mo": "Main canister actor implementing access control, user approval, profile management, and user blocking using mixins and Map-based storage.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for recent UI and settings enhancements.",
  "frontend-file-summaries.txt": "JSON-like mapping providing short descriptions of various frontend files for reference.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook explaining how to retry deployments, including steps for rebuild, monitoring, log capture, and common issue guidance.",
  "frontend/index.css": "Tailwind base layers and CSS variables defining light/dark theme colors, borders, and global styling.",
  "frontend/index.html": "HTML entry point setting up root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app wiring authentication, block checks, storage migrations, and routing between login, admin panel, user dashboard, and blocked view.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable action-tile component with gradient backgrounds, size variants, and icon/label rendering.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Exports shared Tailwind class constants for consistent dashboard borders, padding, and styling.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Reusable confirmation dialog using AlertDialog with customizable text, variant, and confirm/cancel handlers.",
  "frontend/src/components/feedback/notify.ts": "Simple wrapper around sonner toast providing success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout shell with header, footer, and logout confirmation dialog, plus quick-action buttons for loan and calculator.",
  "frontend/src/components/layout/BottomSheet.tsx": "Bottom sheet modal component with backdrop, slide-up animation, and scroll lock handling.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Configurable footer bar providing up to three action buttons with icons and gradients.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Centered container layout with fixed height and professional background styling for dashboard views.",
  "frontend/src/components/layout/PopupModal.tsx": "Full-screen popup modal with backdrop, close button, scroll lock, and animated scaling.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel controller that switches between dashboard sections, handles logout, and renders various admin views.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for admin views with icons and active-state highlighting.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid-based admin menu showing navigational tiles whose labels support overrides and branding.",
  "frontend/src/features/admin/components/AdminHeaderAvatar.tsx": "Displays the admin avatar by checking identity, stored profile photos, branding logo, or a fallback image.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides the main admin page layout with a fixed header, avatar, optional actions, scrollable content, and a footer with configurable buttons.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines admin navigation view types and a list of labeled navigation items with associated icons.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account data from storage and shows KPI-style summary cards for income, expenses, and due amount.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user approval requests, allowing approve/reject actions with confirmation and storage updates.",
  "frontend/src/features/admin/sections/BlockUsersSection.tsx": "Lists approved users, shows their block status, and supports blocking/unblocking them via backend actor calls.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Handles adding, listing, and deleting company payment reports while showing totals and requiring confirmation before saving.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Displays final balances per worker by loading stored workers and account totals and computing remaining amounts.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Manages adding, listing, and deleting snack (nasta) cost entries and updates per‑worker account balances.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles creation and removal of payment/loan entries and updates each worker’s account payment totals.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Records production quantities and rates per worker and maintains a sortable production history without affecting accounts.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Thin wrapper that renders the system settings panel.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Provides full system settings management including labels, layout rules, branding, custom sections, user sharing, and backup import/export.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Displays user approval and blocking management sections.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Manages worker rate settings including add, delete, lock, update rates, and selection state synced with storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Tracks work output using worker-specific rates, computes per‑worker totals, and stores work history entries.",
  "frontend/src/features/auth/BlockedAccountView.tsx": "Displays a blocked account message with logout support.",
  "frontend/src/features/auth/LoginView.tsx": "Provides login form handling, validation, branding display, and toggling to registration view.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles new user registration requests with validation and storage of pending requests.",
  "frontend/src/features/support/SupportView.tsx": "Implements support messaging for users and admins, loading threads and sending messages.",
  "frontend/src/features/user/components/ClockCard.tsx": "Shows a live updating digital clock with formatted time and date.",
  "frontend/src/features/user/components/SelectedWorkersTotalReportSheet.tsx": "Displays a bottom sheet showing selected workers with total work, cost, and due amounts loaded from storage.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Renders KPI summary cards for due, work, and taken amounts with customizable labels.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays a user's filtered nasta history entries with per‑head totals and a grand total.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows filtered payment (loan) history for the logged‑in user and calculates total per‑head amounts.",
  "frontend/src/features/user/production/productionAggregates.ts": "Aggregates normalized production history by worker to compute totals for double, single, and earnings.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays production history with summary totals and a table of worker entries sorted by timestamp.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Normalizes various worker-name fields into a consistent array of worker names.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "Provides a profile settings page allowing users to change their password and view their profile image.",
  "frontend/src/features/user/UserDashboard.tsx": "Renders the main user dashboard with KPI loading, navigation between history views, and branding integration.",
  "frontend/src/features/user/work/WorkEntryActionSheet.tsx": "Displays a modal showing details of a work entry and the user's calculated amount with a close action.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Loads and displays filtered work history for the logged‑in user and opens an action sheet for entry details.",
  "frontend/src/features/work/workAmount.ts": "Provides functions to compute per‑user and total work amounts using new, legacy, or fallback rate data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useBranding.ts": "Reads and updates branding settings and listens for update events to refresh state.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard label overrides and updates state when override events are dispatched.",
  "frontend/src/hooks/useHashRoute.ts": "Tracks the current hash‑based route and provides a navigation helper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence.",
  "frontend/src/hooks/useSingleConfirmSubmit.ts": "Manages a confirmation‑based submit flow with duplicate‑submit prevention.",
  "frontend/src/hooks/useUserNotice.ts": "Loads user notice configuration and updates when notice events occur.",
  "frontend/src/index.css": "Tailwind base and utility layers plus custom gradients, colors, layout helpers, and admin UI styles.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage, merging defaults, saving updates, and providing fallback logo URLs.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Handles admin credential storage with validation and comparison using safe storage helpers.",
  "frontend/src/lib/storage/adminDashboardLayoutRulesStorage.ts": "Stores and manages dashboard layout rules including ordering, sizes, and updates via localStorage.",
  "frontend/src/lib/storage/adminSelectedWorkersStorage.ts": "Manages selected worker names for reports, supporting load, save, toggle, remove, and initialization.",
  "frontend/src/lib/storage/adminTotalsStorage.ts": "Loads and saves admin total metrics with safe fallbacks on malformed data.",
  "frontend/src/lib/storage/backupRestore.ts": "Exports selected app data to a JSON backup and restores it, using safe getters and user notifications.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages payment-type company reports, normalizes legacy data, and computes total work earned.",
  "frontend/src/lib/storage/customSectionsStorage.ts": "Loads and saves custom dashboard section definitions including size and placement.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Loads, saves, and resets customizable dashboard label overrides with update events.",
  "frontend/src/lib/storage/labelSettingsStorage.ts": "Provides ordered label settings with defaults, saving updates and merging legacy entries.",
  "frontend/src/lib/storage/noticeStorage.ts": "Manages user notice banner configuration with simple load/save and update events.",
  "frontend/src/lib/storage/productionHistoryStorage.ts": "Loads and normalizes production history entries for consistent UI rendering and saves raw entries.",
  "frontend/src/lib/storage/safeStorage.ts": "Wraps localStorage with safe read/write/remove helpers, array normalization, and storage update events.",
  "frontend/src/lib/storage/storageSchema.ts": "Handles versioned localStorage migrations, normalizing histories, worker data, and company reports.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support message threads in localStorage, allowing retrieval and message appending.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and maintains stable numeric user IDs for approved users, with lookup helpers.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores and retrieves profile photos for users and admins using localStorage.",
  "frontend/src/lib/storage/userSharingSettingsStorage.ts": "Loads and saves sharing settings with defaults and dispatches update events.",
  "frontend/src/lib/storage/workerRatesStorage.ts": "Loads, saves, and migrates worker rate data, including lock state and legacy format syncing.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider.",
  "frontend/src/state/session/SessionProvider.tsx": "Provides session state, login/logout logic, user ID handling, and profile updates.",
  "frontend/src/state/session/sessionTypes.ts": "Defines session, login, user, and request-related TypeScript interfaces.",
  "frontend/src/state/session/useSession.ts": "Exposes a hook to access the session context.",
  "frontend/src/utils/moneySplit.ts": "Provides equal-split money calculations and helpers for per-head amounts.",
  "frontend/src/utils/urlParams.ts": "Utilities for parsing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom color tokens, typography/animation plugins, and extended theme settings. Defines container sizing, custom keyframes, animations, and UI color palettes via CSS variables.",
  "project_state.json": "Project state describing UI/UX polishing tasks for an admin panel, listing issues, required images, and feature requests for layout, dropdown readability, input styling, and header avatar addition."
}