{
  "backend/main.mo": "Canister actor implementing access control, user approval, profile management, and blocklist functionality using mixins and Map storage.",
  "feature_evidence.json": "JSON report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing functionality of various frontend source files.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook explaining how to retry deployments, monitor results, and handle common infrastructure issues.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling session flow, user blocking checks, and routing between login, registration, admin, and user views.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable gradient action tile component with size variants for admin, user, and small modes.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Shared Tailwind class constants defining consistent borders, padding, and styling for dashboard UI elements.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "A customizable confirmation dialog using AlertDialog components with confirm and cancel handlers.",
  "frontend/src/components/feedback/notify.ts": "A wrapper around the sonner toast API providing success, error, and info notification helpers.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with header, branding, scroll effects, navigation buttons, and logout handling.",
  "frontend/src/components/layout/BottomSheet.tsx": "A bottom sheet modal component that locks body scroll and supports closing via backdrop or button.",
  "frontend/src/components/layout/DashboardFooter.tsx": "A footer with three configurable action buttons styled for dashboard navigation.",
  "frontend/src/components/layout/DashboardFrame.tsx": "A layout wrapper that centers and constrains content within a framed dashboard container.",
  "frontend/src/components/layout/PopupModal.tsx": "A fullscreen modal with backdrop, close button, scrollable content, and body scroll locking.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin panel controller that switches between admin views and handles MT-Loan prompt display.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for admin views with icons and active-state styling.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid of admin action tiles that navigate to various admin sections with customizable labels.",
  "frontend/src/features/admin/components/AdminHeaderAvatar.tsx": "Displays the admin avatar with priority-based image loading and updates on profile or storage changes.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides the main admin layout with a dynamic header, navigation handling, and logout control.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines admin view types and the navigation items with labels and icons.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Shows income, expense, and due summary cards by reading account data from storage.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user approval requests with approve/reject actions stored in local storage.",
  "frontend/src/features/admin/sections/BlockUsersSection.tsx": "Fetches approved users and allows blocking or unblocking them through backend actor calls.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Handles adding, listing, and deleting company payment reports and shows total earned vs paid.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Loads workers and account data from storage and displays each worker’s bill, cost, and final balance in a table.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Manages snack expense entries by splitting amounts among selected workers, updating histories and individual accounts, and allowing deletion.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles payment or loan entries, splitting amounts per worker, storing history, updating accounts, and supporting deletion.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Records production output per worker with rates and quantities, saves entries to history, and allows deletion without affecting accounts.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper component that renders the system settings panel.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Provides UI for managing labels, layout rules, branding, custom sections, MT loan settings, user sharing, and admin profile photo.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Displays user approval and blocking sections together.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Manages worker rate settings including add, delete, lock, update rates, and selection persistence.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Creates work entries using worker-specific rates to compute totals, stores history, validates rates, and supports deletion.",
  "frontend/src/features/auth/BlockedAccountView.tsx": "Displays a blocked account notice with logout option.",
  "frontend/src/features/auth/LoginView.tsx": "Provides a login form with branding, validation, and session login handling.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles user registration with validation, pending request storage, and confirmation dialog.",
  "frontend/src/features/mt-loan/MtLoanPasswordPrompt.tsx": "Prompts for MT Loan password, validates it, and authorizes access with identity setup.",
  "frontend/src/features/mt-loan/UserPanelLayoutSkeleton.tsx": "Placeholder component for a future user panel layout; currently returns null.",
  "frontend/src/features/support/SupportView.tsx": "Implements admin and user support messaging with threads, message sending, and thread selection.",
  "frontend/src/features/user/components/ClockCard.tsx": "Displays a live-updating digital clock and formatted date.",
  "frontend/src/features/user/components/SelectedWorkersTotalReportSheet.tsx": "Bottom-sheet report summarizing selected workers and calculating total work, cost, and due amounts.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Shows KPI summary cards for total due, total work, and total cost using themed styles.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays per-user nasta expense history with totals and back navigation.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows filtered loan/payment history for the user, computing per-head totals.",
  "frontend/src/features/user/production/productionAggregates.ts": "Aggregates normalized production history by worker, summing double, single, and earnings totals.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays production history with summary totals and a detailed table sorted by timestamp.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Normalizes worker name fields, returning available name arrays or a fallback value.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "React view for profile settings that handles password changes and displays user/branding info.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard managing view modes, loading KPI data from storage, and routing to history and settings views.",
  "frontend/src/features/user/work/WorkEntryActionSheet.tsx": "Displays a modal with detailed info for a single work entry, including the user's amount.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Loads and shows a user-filtered work history table with totals and detail view actions.",
  "frontend/src/features/work/workAmount.ts": "Computes per-user and group totals for work entries using multiple data formats and rate fallbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBranding.ts": "Provides branding settings with live update handling and an update helper.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard overrides and updates state when override change events fire.",
  "frontend/src/hooks/useHashRoute.ts": "Manages navigation using window.location.hash with state syncing and helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useSingleConfirmSubmit.ts": "Manages a single-confirm submit flow with duplicate-submit protection.",
  "frontend/src/hooks/useUserNotice.ts": "React hook that loads notice config from storage and updates state when a custom event fires.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode styles, gradients, and utility classes.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage and exposes helpers for retrieving branding and logo URLs.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Stores, loads, validates, and updates admin username/password using safe storage helpers.",
  "frontend/src/lib/storage/adminDashboardLayoutRulesStorage.ts": "Handles saving, loading, updating, and deleting admin dashboard layout rules in localStorage.",
  "frontend/src/lib/storage/adminSelectedWorkersStorage.ts": "Manages a saved list of selected workers with helpers for toggling, checking, and cleaning selections.",
  "frontend/src/lib/storage/adminTotalsStorage.ts": "Simple load/save utilities for admin totals (taken, work, due) persisted in localStorage.",
  "frontend/src/lib/storage/backupRestore.ts": "Exports selected app data to a JSON backup and restores data from uploaded backup files.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Stores and manages company payment reports, normalizes legacy data, and calculates total work earned.",
  "frontend/src/lib/storage/customSectionsStorage.ts": "Loads and saves custom dashboard section definitions with size and placement options.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Manages configurable dashboard label overrides and notifies listeners when updates occur.",
  "frontend/src/lib/storage/labelSettingsStorage.ts": "Loads, merges, updates, and saves customizable label entries with ordering support.",
  "frontend/src/lib/storage/mtLoanAuthStorage.ts": "Handles session-based authorization flag for MT Loan features.",
  "frontend/src/lib/storage/mtLoanIdentityStorage.ts": "Stores, retrieves, and clears a simple MT Loan identity record using safe storage functions.",
  "frontend/src/lib/storage/mtLoanSettingsStorage.ts": "Manages loan settings in localStorage, including loading, saving, and validating passwords.",
  "frontend/src/lib/storage/noticeStorage.ts": "Handles loading and saving user dashboard notice configuration with localStorage and emits update events.",
  "frontend/src/lib/storage/productionHistoryStorage.ts": "Loads, normalizes, and saves production history entries ensuring consistent structure for UI use.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for localStorage operations with error handling, array normalization, and update event subscriptions.",
  "frontend/src/lib/storage/storageSchema.ts": "Runs versioned storage migrations to normalize and update various stored data structures.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Stores and retrieves support message threads, allowing messages to be added per user.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and maintains stable numeric user IDs for approved users, ensuring legacy users get IDs.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Manages profile photo storage for users and admin, including set, get, and removal with update events.",
  "frontend/src/lib/storage/userSharingSettingsStorage.ts": "Loads and saves user sharing settings with defaults and dispatches update events.",
  "frontend/src/lib/storage/workerRatesStorage.ts": "Loads, saves, and migrates worker rate data, supporting lock state and legacy compatibility.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/state/session/SessionProvider.tsx": "Provides session context, handles restoring, login/logout, and user profile updates with localStorage and user ID management.",
  "frontend/src/state/session/sessionTypes.ts": "Defines session-related interfaces including Session, LoginResult, UpdateProfileParams, context shape, and user record structures.",
  "frontend/src/state/session/useSession.ts": "Custom hook that retrieves the session context and enforces usage within SessionProvider.",
  "frontend/src/utils/moneySplit.ts": "Implements consistent per-person money-splitting logic with rounding and fallbacks for legacy data.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration customizing colors, animations, fonts, and container settings with plugin support.",
  "project_state.json": "Stores project metadata, known issues, and feature requests for navigation updates, logout reinstatement, and UI text fixes."
}