{
  "backend/main.mo": "Main Motoko canister with access control, user approvals, profile storage, and authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of each frontend file for build reference.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme colors and global element styling.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main entry script.",
  "frontend/src/App.tsx": "Top-level React app handling session-based routing between login, admin panel, and user dashboard.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable square action-tile button with gradient backgrounds and size variants for dashboards.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Centralized Tailwind class constants for consistent dashboard border, padding, and sizing styles.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Reusable confirmation dialog built on alert-dialog components with customizable text and actions.",
  "frontend/src/components/feedback/notify.ts": "Wrapper around Sonner toast API for unified success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Admin layout shell with header, footer, logout confirmation dialog, and gradient background.",
  "frontend/src/components/layout/BottomSheet.tsx": "A bottom sheet component that locks page scroll, shows a backdrop, and displays dismissible slide-up content.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Footer with settings and support/chat buttons styled with gradients and icons.",
  "frontend/src/components/layout/DashboardFrame.tsx": "A centered screen frame providing a bordered, full‑height container for dashboard views.",
  "frontend/src/components/layout/PopupModal.tsx": "A fullscreen modal with backdrop, scroll lock, close button, and scrollable content area.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin panel controller that switches between dashboard and various admin sections, managing logout and layout.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for admin views with icons and active state highlighting.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid of action tiles linking to admin sections, with labels and gradient icons configurable through overrides.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Shared layout wrapper for admin sections with fixed header, scrollable body, and footer.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines AdminView union type and navigation item metadata for admin screens.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account data from storage and displays income, expense, and due values in styled KPI cards.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user approvals, handling duplicate checks, moving approved users to storage, and updating accounts.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Provides form and tables for adding and viewing company financial reports of type taken or due.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Displays final balance table for workers using stored bill and cost data.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Allows adding snack expenses shared among workers, updates cost balances, and manages history with delete support.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles adding and deleting loan/payment entries for workers and updates their cost accounts.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Adds production work entries for workers, calculates totals, updates bill accounts, and manages history with deletion.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper that renders the system settings section.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Renders system settings tabs for branding, labels, notices, and sections, with branding including logo upload and company name editing.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Wraps the ApprovalsSection component to display and manage user approval requests.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Allows adding workers and editing or deleting their single/double rate settings, persisted in local storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Manages worker task entries, calculates payment amounts, stores history, and updates worker accounts with add/delete operations.",
  "frontend/src/features/auth/LoginView.tsx": "Provides the login form with branding display, handling authentication and optional switch to registration.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles user registration requests with duplicate checks and saves pending requests for admin approval.",
  "frontend/src/features/support/SupportView.tsx": "Displays support threads and messaging for users and admins, allowing viewing and sending messages.",
  "frontend/src/features/user/components/ClockCard.tsx": "Shows a live-updating digital clock with formatted date and time.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Renders KPI summary cards for total due, total work, and total cost.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays a user's nasta history with per-entry amounts and total calculation.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows user's loan/payment history filtered by username and computes per-entry and total amounts.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays user production history entries with totals for body count and earnings.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Utility to format worker names from an entry, falling back to 'Unknown worker' if missing.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "React view for updating user profile photo, mobile number, and password with validation and session integration.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard that switches between views like production, work, payments, profile, and support.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Displays a user's filtered work history and computes their total earnings using stored history data.",
  "frontend/src/features/work/workAmount.ts": "Provides functions to calculate per-user and group work amounts using detail entries or fallback rate data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBranding.ts": "Hook for reading and updating branding settings stored in localStorage with event-driven sync.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard UI override labels and listens for update events to keep state synchronized.",
  "frontend/src/hooks/useHashRoute.ts": "Simple hash-based routing hook that listens to hash changes and provides navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useUserNotice.ts": "Loads and tracks notice configuration from storage and updates on dispatched events.",
  "frontend/src/index.css": "Global Tailwind CSS setup with color themes, gradients, animations, and UI utilities.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage and dispatches update events; provides logo and image helpers.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages CRUD operations for company report entries in localStorage, including filtering by type.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Stores, loads, updates, and resets customizable dashboard label overrides in localStorage with update events.",
  "frontend/src/lib/storage/noticeStorage.ts": "Handles saving and loading of user dashboard scrolling notice settings from localStorage.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for reading, writing, and validating values and arrays in localStorage.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures storage schema versioning by clearing legacy keys and setting a migration flag.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Stores support chat threads and messages per user in localStorage and supports message appending.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and persists stable numeric user IDs for approved users and retrieves IDs by name or mobile.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Reads, writes, and removes profile photos in localStorage using a name-based key.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/state/session/SessionProvider.tsx": "Manages session state, login/logout logic, profile updates, and session persistence in localStorage.",
  "frontend/src/state/session/sessionTypes.ts": "Defines session-related types including session structure, login results, and user models.",
  "frontend/src/state/session/useSession.ts": "Provides a hook to access the session context safely.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters with support for hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom color variables, animations, typography, and container settings. Extends theme with custom HSL color tokens, fonts, radii, and animation keyframes.",
  "project_state.json": "Project state describing required updates to the user panel header, auto-incrementing user IDs, and layout fitting within a single screen. Includes feature lists, known issues, and pending requests for UI and ID logic fixes."
}