{
  "backend/main.mo": "Main canister actor wiring storage, access control, and user approval with profile CRUD and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files for reference.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook explaining how to retry deployments and troubleshoot repeated failures.",
  "frontend/index.css": "Tailwind setup defining light/dark CSS variables and global base styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling session routing and theme/session providers.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable gradient action tile component with size variants for dashboards.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Shared Tailwind class constants for borders, padding, and styling of dashboard components.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Reusable confirmation dialog built on AlertDialog with customizable text and variants.",
  "frontend/src/components/feedback/notify.ts": "Toast notification helper wrapping Sonner for success, error, and info messages.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, footer, action buttons, and a logout confirmation dialog.",
  "frontend/src/components/layout/BottomSheet.tsx": "Implements a bottom sheet modal with backdrop, scroll lock, and close controls.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Renders footer buttons for support and settings with customizable labels.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Defines a centered mobile-style dashboard frame with fixed height and background styling.",
  "frontend/src/components/layout/PopupModal.tsx": "Creates a full-screen popup modal with animated entrance, scroll lock, and close button.",
  "frontend/src/features/admin/AdminPanel.tsx": "Controls the main admin panel view switching, dashboard layout, logout flow, and section rendering.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Displays a fixed bottom navigation bar for switching between admin views.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Renders a grid of action tiles for navigating between admin sections with themed icons.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides a reusable admin page layout with header, optional back button, and footer.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines admin view types and navigation items with labels and icons.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Calculates and displays income, expense, and due totals using styled KPI cards.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user registrations, approving or rejecting requests and updating local storage accounts.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Handles creating, listing, and deleting company financial reports with taken/due tracking.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Displays workers’ final balances by reading stored bill and cost data.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Adds and manages snack cost entries for workers and updates their account costs.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Records worker payments or loans, updates account costs, and manages history entries.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Logs production work entries for workers, calculating totals without modifying accounts.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Thin wrapper that renders the system settings section.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Loads and manages label settings, totals, layout rules, and branding data with tabs for editing and saving each group.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Displays user approval requests by rendering the ApprovalsSection component.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Manages worker list and their single/double rates with add, update, and delete operations stored in local storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Handles work entry creation, validation, worker selection, rate calculations, and history management using local storage.",
  "frontend/src/features/auth/LoginView.tsx": "Provides a login form with branding display, handling authentication, errors, and navigation to registration.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles new user registration by storing pending requests and showing branding and a registration form.",
  "frontend/src/features/support/SupportView.tsx": "Displays support messaging threads, letting admins browse users and both sides send messages.",
  "frontend/src/features/user/components/ClockCard.tsx": "Shows a live-updating digital clock with formatted time and date.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Renders KPI cards summarizing total due, total work, and total cost for a user.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays a user’s nasta-related expense history with totals.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Loads and displays a user’s loan/payment history and computes total amounts.",
  "frontend/src/features/user/production/productionAggregates.ts": "Aggregates production history by worker, summing single, double, and earnings per worker.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Shows sorted production history entries and computes summary totals across workers.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Normalizes worker name fields, returning the best available name list or a fallback.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "React view for editing profile settings including photo, name, phone, and password updates.",
  "frontend/src/features/user/UserDashboard.tsx": "Controls navigation between user dashboard subviews and loads summary account/profile data.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Displays a user's filtered work history with totals for quantities and earnings.",
  "frontend/src/features/work/workAmount.ts": "Computes per‑user and group work amounts using detailed bills or legacy rate calculations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching when identity changes.",
  "frontend/src/hooks/useBranding.ts": "Loads branding settings and updates state when storage events occur.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Provides dashboard override labels and listens for override update events.",
  "frontend/src/hooks/useHashRoute.ts": "Manages client-side routing based on the URL hash with navigation helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, identity loading, and state management.",
  "frontend/src/hooks/useSingleConfirmSubmit.ts": "Manages a confirmation-based submit flow with duplicate submission prevention.",
  "frontend/src/hooks/useUserNotice.ts": "Loads and updates user notice configuration in response to storage events.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, and utility classes.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage, merging defaults and providing logo URLs with fallbacks.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Stores admin credentials safely, loads defaults, saves updates, and validates login.",
  "frontend/src/lib/storage/adminDashboardLayoutRulesStorage.ts": "Handles saving, loading, and updating admin dashboard layout rules in localStorage.",
  "frontend/src/lib/storage/adminTotalsStorage.ts": "Loads and saves admin total metrics with simple localStorage persistence and defaults.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages company financial report entries, including adding, filtering, and deleting records.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Stores customizable dashboard label overrides and dispatches update events on change.",
  "frontend/src/lib/storage/labelSettingsStorage.ts": "Loads, updates, and persists label settings with serial ordering and optional overrides.",
  "frontend/src/lib/storage/noticeStorage.ts": "Stores and retrieves user dashboard scrolling notice configuration.",
  "frontend/src/lib/storage/productionHistoryStorage.ts": "Normalizes and loads production history entries, and saves them using safe storage utilities.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers around localStorage access with JSON parsing and array normalization.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures storage schema versioning by clearing legacy keys and marking migration completion.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support messaging threads, adding messages and retrieving per-user conversation history.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and ensures stable numeric user IDs for approved users, updating legacy entries.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes per-user profile photos in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider into the root element.",
  "frontend/src/state/session/SessionProvider.tsx": "Implements a React context provider managing session state, restoring from storage, and handling login, logout, and profile updates for users and admins.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript types for session data, login results, profile updates, and user records.",
  "frontend/src/state/session/useSession.ts": "Provides a hook to access the SessionContext and enforce usage within the provider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them to sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, typography, and theming extensions.",
  "project_state.json": "Tracks project metadata, features, issues, and architectural notes for ongoing admin panel updates."
}