{
  "backend/main.mo": "Actor combining blob storage, access control, and user-approval logic, providing approval workflows and user profile CRUD with permission checks.",
  "feature_evidence.json": "Feature-evidence report linking a deployment retry requirement to related files, components, and test metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used for build or documentation reference.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook describing how to re-trigger a build/deploy without code changes and troubleshoot transient deployment failures.",
  "frontend/index.css": "Tailwind-based global CSS defining theme variables, light/dark modes, and base styling rules.",
  "frontend/index.html": "HTML entry point loading the React app with a root div and main.tsx script.",
  "frontend/src/App.tsx": "Main React component handling session initialization, login, admin panel, and user dashboard routing inside theme and session providers.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable action tile component with size variants, gradients, icons, and mobile‑optimized layout.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Shared Tailwind class constants for consistent dashboard borders, padding, and container styling.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Configurable confirmation dialog using alert‑dialog components with customizable actions and variants.",
  "frontend/src/components/feedback/notify.ts": "Toast-based notification helper providing success, error, and info message utilities.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper with header, footer, logout flow, and confirmation dialog integration.",
  "frontend/src/components/layout/BottomSheet.tsx": "Modal bottom-sheet component with backdrop, slide-up animation, scroll lock, and close controls.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Renders a footer with optional settings button and a support/chat button using Tailwind and Lucide icons.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Provides a centered fixed-size dashboard container with a styled background.",
  "frontend/src/components/layout/PopupModal.tsx": "Implements a full-screen modal with backdrop, scrollable content, and a close button while disabling body scroll.",
  "frontend/src/features/admin/AdminPanel.tsx": "Controls the admin panel views, header, footer, navigation logic, and logout flow within a dashboard frame.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Displays a fixed bottom navigation bar for switching between admin views.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Shows a 3-row grid of action tiles for navigating to different admin sections with customizable labels.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides a page shell with fixed header, scrollable content area, and footer for admin subpages.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines the AdminView type and navigation item metadata for admin sections.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account data from storage and displays KPI cards for due, total income, and total expenses.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user approvals, allowing admins to approve or reject registrations and update stored user/account data.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Manages adding and listing company taken/due reports using local storage with form inputs and tables.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Displays final balance per worker by loading stored worker and account data and calculating remaining balances.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Handles snack expense entries for selected workers, updates cost accounts, and manages history with delete support.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Records loan/payment entries for workers, updates account costs, and manages entry history with deletion.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Adds production work entries, updates worker bill totals, and displays sortable production history with delete options.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper that renders the system settings section.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Provides tabs for branding, labels, notices, and section settings, including logo upload and various config editors.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Renders the approvals section for handling user requests.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Provides UI to add workers and manage their single/double rates, persisting updates to local storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Manages worker work entries, saving counts, calculating amounts, and updating history and accounts in local storage.",
  "frontend/src/features/auth/LoginView.tsx": "Handles user login with branding display, form validation, and session authentication.",
  "frontend/src/features/auth/RegisterView.tsx": "Processes user registration requests, checks duplicates, assigns IDs, and stores pending requests.",
  "frontend/src/features/support/SupportView.tsx": "Displays support threads and messaging, allowing users or admins to send and view messages via stored threads.",
  "frontend/src/features/user/components/ClockCard.tsx": "A live clock component showing current time and date.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Displays user's total due, work, and taken amounts using styled KPI cards.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays user's nasta history with per-entry and total calculations.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows loan/payment records relevant to the user with calculated per-user amounts.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays production records for the user including totals for body count and earnings.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Utility to format worker names from entries, falling back to 'Unknown worker'.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "User profile settings page allowing photo upload, mobile changes, and password updates.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard managing view modes, loading user totals, and routing to history or profile views.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Displays a user's filtered work history from local storage and calculates per-entry and total earnings.",
  "frontend/src/features/work/workAmount.ts": "Provides helpers to compute per-user and group work amounts using details or fallback rate data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBranding.ts": "Loads and updates branding settings from local storage and listens for branding update events.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Retrieves dashboard label overrides and updates state when override events are dispatched.",
  "frontend/src/hooks/useHashRoute.ts": "Manages simple hash-based routing with automatic updates on hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout via a React context.",
  "frontend/src/hooks/useUserNotice.ts": "Loads the scrolling notice configuration and updates when notice config events occur.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, gradients, utilities, and animations for the UI.",
  "frontend/src/lib/branding/brandingStorage.ts": "Stores and retrieves branding settings in local storage and dispatches events on updates.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages CRUD operations for company report entries stored in local storage.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Handles loading, saving, and resetting dashboard override labels in local storage with event dispatching.",
  "frontend/src/lib/storage/noticeStorage.ts": "Manages saving and loading the user notice configuration with event updates.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for localStorage get/set/remove operations and utilities for handling arrays.",
  "frontend/src/lib/storage/storageSchema.ts": "Handles one-time migration by clearing legacy storage keys and setting a storage schema version.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support message threads in localStorage, including retrieving, updating, and adding messages.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and maintains stable numeric user IDs for approved users and retrieves IDs by name or mobile.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes base64 profile photos in localStorage using a username-based key.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider and renders the root component.",
  "frontend/src/state/session/SessionProvider.tsx": "Implements session state, login/logout, profile updates, and restores sessions while ensuring user IDs.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript interfaces for session objects, user data, and related session operations.",
  "frontend/src/state/session/useSession.ts": "Custom hook that provides access to the session context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and extended theme settings.",
  "project_state.json": "Metadata describing the project state, versions, issues, and features."
}