{
  "backend/main.mo": "Motoko canister implementing user profiles, access control, and approval flows using mixins and maps.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend source files.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook explaining how to retry deployments and diagnose common build issues.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, themes, and global base styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component that selects between login, admin panel, or user dashboard based on session state.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable dashboard tile component with configurable size presets, icons, and gradient backgrounds.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Exports shared Tailwind class constants for consistent dashboard borders, padding, and styling.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Configurable confirmation dialog built on shadcn alert dialog components.",
  "frontend/src/components/feedback/notify.ts": "Wrapper for Sonner toast notifications providing success, error, and info helpers.",
  "frontend/src/components/layout/AppShell.tsx": "Layout shell with header, footer, and logout confirmation dialog wrapping children.",
  "frontend/src/components/layout/BottomSheet.tsx": "Mobile bottom‑sheet overlay component with backdrop, close button, and scroll lock.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Footer containing support and optional settings buttons for dashboard-style views.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Centered mobile-style frame layout container for admin dashboard content.",
  "frontend/src/components/layout/PopupModal.tsx": "Fullscreen modal with backdrop, close button, scroll lock, and scrollable content.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin panel controller managing active view, header, logout, and section rendering.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Fixed bottom navigation bar for switching admin views with icons and labels.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid menu of action tiles grouped in rows for navigating to admin sections.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Admin page layout with fixed header, optional back button, scrollable content, and footer.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines AdminView type, nav item interface, and list of admin navigation items.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account totals from storage and displays income, expense, and due KPI cards.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Manages pending user approvals, checks duplicates, updates approved users and accounts, and handles accept/reject actions.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Allows adding company financial reports and displays taken and due report histories sorted by timestamp.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Loads worker accounts and displays final balances based on total bill and cost values.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Records shared snack expenses, distributes costs among selected workers, updates account balances, and maintains editable history.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Adds payment or loan entries split among workers, updates account costs, and supports deleting past entries.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Adds production entries, calculates totals per worker, updates account bills, and manages production history with deletion.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper component that renders the system settings section.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Renders a tabbed admin settings UI with sections for branding, labels, notices, admin credentials, and sections management.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Wraps and displays the ApprovalsSection component for handling user request approvals.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Allows adding, deleting, and editing workers and their rate settings persisted in storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Manages creating, listing, and deleting work entries while updating worker accounts and stored history.",
  "frontend/src/features/auth/LoginView.tsx": "Provides a login form using session hooks and branding settings, with optional navigation to registration.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles new user registration requests with validation, duplicate checks, and storing pending requests.",
  "frontend/src/features/support/SupportView.tsx": "Displays support threads and messaging, letting admins view all threads and users view their own; handles sending messages and navigation.",
  "frontend/src/features/user/components/ClockCard.tsx": "Shows a live-updating digital clock with formatted date and time.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Displays user's KPI totals including due, work, and taken amounts using styled KPI cards.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays a user's snack (nasta) expense history with per-entry details and total calculation.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows the user’s loan/payment history filtered from stored records, including per-entry breakdown and total amount.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays the user’s production work history with totals for body count and earnings.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Formats worker names, returning provided names or a fallback of 'Unknown worker'.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "React view for editing profile info, uploading profile photos, and changing passwords.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard switching between multiple views like production, work, payments, profile, and support; also loads summary metrics and profile info.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Loads and displays a user's work history with totals for s, d, and money earned.",
  "frontend/src/features/work/workAmount.ts": "Computes per‑user and group total amounts for work entries using details or stored rates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useBranding.ts": "Provides branding settings and updates them when storage changes.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard override labels and updates them via custom events.",
  "frontend/src/hooks/useHashRoute.ts": "Tracks and updates navigation state using URL hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, login state, and stored identity loading.",
  "frontend/src/hooks/useUserNotice.ts": "Loads user notice configuration and updates it on storage events.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables, gradients, and UI utilities.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage with defaults and helper getters for logo URLs.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Stores, loads, and validates admin login credentials using safe storage helpers.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Handles CRUD operations for company financial reports stored in localStorage.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Saves, loads, and resets admin-configurable dashboard text overrides in localStorage.",
  "frontend/src/lib/storage/noticeStorage.ts": "Stores and retrieves the scrolling notice configuration for the user dashboard.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for reading, writing, and validating localStorage data including arrays.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures migration to the current storage schema by clearing legacy keys and setting a version flag.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support message threads per user, allowing retrieval and message appending.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and maintains stable auto-incremented user IDs for approved users.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes user profile photos by username in localStorage.",
  "frontend/src/main.tsx": "Bootstraps the React application with query client and Internet Identity provider.",
  "frontend/src/state/session/SessionProvider.tsx": "Handles session state, login/logout logic, and profile updates with localStorage persistence.",
  "frontend/src/state/session/sessionTypes.ts": "Defines types for session data, login results, profile updates, and user records.",
  "frontend/src/state/session/useSession.ts": "Provides a hook to access the session context with error handling if misused.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters for routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling class-based dark mode, custom color palette via CSS variables, extended animations, and plugins for animations and typography.",
  "project_state.json": "Project metadata describing a UI/UX fix request with issue notes and multiple feature items related to typography, sizing, colors, and admin panel styling."
}