{
  "backend/main.mo": "Actor combines access control, user approval, and profile storage with functions for approval management and user profile CRUD.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind base theme defining color variables and global styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component routing between login, admin panel, and user dashboard using session state and theming.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable action tile component with gradient backgrounds and size variants for admin/user/mobile layouts.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Exports shared Tailwind class constants for consistent border, padding, and radius styling across dashboard components.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "Reusable confirmation dialog using alert-dialog UI components with customizable text and variants.",
  "frontend/src/components/feedback/notify.ts": "Toast wrapper providing standardized success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "App shell layout with gradient header, logout confirmation dialog, and footer wrapper around child views.",
  "frontend/src/components/layout/BottomSheet.tsx": "Provides a bottom sheet overlay with backdrop, scroll lock, close button, and animated slide‑up content.",
  "frontend/src/components/layout/DashboardFooter.tsx": "Renders a footer with optional settings button and a support/chat button styled with gradients and icons.",
  "frontend/src/components/layout/DashboardFrame.tsx": "Wraps content inside a centered mobile-style dashboard frame with fixed dimensions and background styling.",
  "frontend/src/components/layout/PopupModal.tsx": "Implements a full-screen modal with backdrop, scroll locking, a top-right close button, and scrollable content.",
  "frontend/src/features/admin/AdminPanel.tsx": "Controls the admin panel’s active view, header, footer, logout flow, and renders various admin sections based on navigation state.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Displays a fixed bottom navigation bar for admin views with icons and active-state styling.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Shows a 3‑row grid of ActionTiles for navigating between admin sections, using dynamic labels and themed gradients.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides a reusable page layout for admin sections with fixed header, optional back button, scrollable content, and footer.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines AdminView union type and navigation item metadata for admin panel routes.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account data from storage and displays income, expense, and due totals using styled KPI cards.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Displays pending user approval requests and lets admins approve them by updating local storage and worker data.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Allows adding company financial reports and lists taken and due reports sorted by timestamp.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Shows each worker’s total bill, cost, and final balance from stored account data.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Manages snack cost entries split among selected workers, updates account costs, and supports deleting entries.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles loan/payment entries shared among workers, updates account costs, and allows deleting previous entries.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Records production work with quantity and rate, updates worker bills, and supports deleting entries.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Wrapper that renders the system settings section.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Provides tabbed admin settings including branding, labels, notices, and sections, with logo upload and branding persistence.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Wraps ApprovalsSection to display user approval requests.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Allows adding, editing, and deleting workers and their single/double rates, persisting data in storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Manages work entries, worker selection, rate-based amount calculation, history storage, and deletion with account updates.",
  "frontend/src/features/auth/LoginView.tsx": "Implements login form with branding display, validation, and session login handling, with toggle to registration.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles new user registration requests with duplicate checks and saves pending requests before redirecting to login.",
  "frontend/src/features/support/SupportView.tsx": "Renders user/admin support messaging, loading threads, displaying messages, and sending new messages.",
  "frontend/src/features/user/components/ClockCard.tsx": "Displays a live-updating digital clock with formatted time and date.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Shows KPI cards for user totals including due, work, and taken amounts.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays the user's nasta history, calculating per-entry amounts and totals.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Displays the user’s loan/payment history with per-entry calculations and total amount.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Shows production history entries for the user and aggregates total body and payment.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Utility to format worker names from entry data, returning a list or fallback label.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "Provides a profile settings UI allowing users to update photo, mobile number, and password with validation and session updates.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard managing navigation between views, loading user data, and showing KPIs and actions.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Loads and displays a user's filtered work history with calculated earnings and a total summary.",
  "frontend/src/features/work/workAmount.ts": "Computes per-user and group payment amounts using entry details or fallback rate data from storage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBranding.ts": "Manages branding settings from storage and listens for update events to refresh state.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard override labels from storage and updates state when override events fire.",
  "frontend/src/hooks/useHashRoute.ts": "Implements simple hash-based routing with state sync and navigation helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, session management, and status tracking through a React context provider.",
  "frontend/src/hooks/useUserNotice.ts": "Loads notice configuration and updates state when notice-related events are dispatched.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, gradients, utilities, and animations for the app's styling.",
  "frontend/src/lib/branding/brandingStorage.ts": "Handles branding settings persistence in localStorage and dispatches update events, with helpers for logo URLs.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages company report entries in localStorage, allowing add, retrieve, filter, and delete operations.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Handles saving, loading, and resetting customizable dashboard label overrides in localStorage with update events.",
  "frontend/src/lib/storage/noticeStorage.ts": "Stores and retrieves user dashboard scrolling notice settings in localStorage and dispatches updates.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe wrappers for localStorage access, including array normalization and validation helpers.",
  "frontend/src/lib/storage/storageSchema.ts": "Ensures storage schema versioning by clearing legacy keys and marking the current version.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Maintains support message threads in localStorage, enabling message retrieval and thread updates.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and manages stable numeric user IDs for approved users and retrieves user IDs by name or mobile.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Stores, retrieves, and removes user profile photos in localStorage using a prefixed key.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/state/session/SessionProvider.tsx": "Provides session management including initialization, login handling, schema setup, and user ID assignment.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript interfaces for session state, login results, user profiles, and approval data.",
  "frontend/src/state/session/useSession.ts": "Custom hook to access session context, ensuring it runs within the provider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and managing URL and session parameters, including hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling dark mode and plugins.",
  "project_state.json": "Tracks the UI fix request state, listing existing features, pending requests, and issues related to user dashboard layout, header styling, and registration form theming."
}