{
  "backend/main.mo": "Defines an empty Motoko actor, serving as a placeholder backend canister with no logic implemented.",
  "feature_evidence.json": "Structured report mapping implemented product features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of many frontend source files describing their responsibilities and features.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens, color variables, and light/dark theme styles applied across the app.",
  "frontend/index.html": "HTML entry point that sets up the root container and loads the React application.",
  "frontend/src/App.tsx": "Root React component that initializes theming and session context and conditionally renders auth, admin, or user views with a global toaster.",
  "frontend/src/components/feedback/notify.ts": "Utility wrapper around the Sonner toast library providing standardized success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Shared page layout with header, footer, branding, and logout handling for authenticated sections, mainly used by the admin panel.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin dashboard container that renders tabbed navigation and loads production, work, nasta, payment, and settings sections.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Admin section for approving pending user registrations, updating workers, rates, and localStorage with confirmation notifications.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Admin UI section to record and manage shared snack (nasta) expenses, splitting costs per selected worker and updating local storage histories and accounts. Supports creating, listing, totaling, and deleting nasta entries with notifications.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Admin UI section for recording payments or loans given to workers, distributing amounts per head and updating account costs and loan history in local storage. Includes CRUD actions and total calculation.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Admin UI section to log production (board work) entries with single/double counts, rates, and total output values. Stores production history locally and allows viewing totals and deleting entries.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Settings and overview section for managing workers, per-worker rates, and viewing final balances (bill vs cost). Allows adding/deleting workers, editing rates, and persists data to local storage.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Admin UI section to record per-worker work entries using individual rates, calculate bills, and update account balances and work history. Supports selecting workers, saving entries, viewing totals, and deleting records.",
  "frontend/src/features/auth/LoginView.tsx": "React login screen that collects mobile and password, calls useSession().login, shows loading and error states, and allows switching to the register view.",
  "frontend/src/features/auth/RegisterView.tsx": "Registration form that saves pending user requests to local storage for admin approval, shows success/error notifications, and switches back to login after submission.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Displays the logged-in user’s payment and expense history from local storage, combining loan and nasta records into a sortable table with totals.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Shows the user’s production/board work history from local storage in a table with totals for bodies and earnings.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Utility function that normalizes worker name data into a string array, handling single, multiple, or missing names.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard showing profile info, balance, and navigation to production, work, and payment history, with local-storage-backed balance and profile picture handling.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "React view that shows the logged-in user’s work history from localStorage in a table, calculating per-entry and total earnings based on session user name. Includes a back button and uses shared Card, Table, and Button UI components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, returning an authenticated or anonymous actor based on Internet Identity. It invalidates and refetches dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, identity state, and detailed login status flags. Wraps AuthClient creation, identity restoration, and exposes a provider and hook for app-wide use.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, color palettes, light/dark themes, and base styles for the app. Establishes a warm, neutral theme and shared chart, border, and typography variables.",
  "frontend/src/lib/storage/safeStorage.ts": "Utility helpers for safely reading, writing, and removing JSON data in localStorage with error handling and default values. Used throughout the app for persistence.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers. Also imports global styles.",
  "frontend/src/state/session/SessionProvider.tsx": "Session context provider that manages admin and user login using localStorage-backed credentials and approved users. Exposes login, logout, session state, and initialization status.",
  "frontend/src/state/session/sessionTypes.ts": "Type definitions for session data and the session context interface, covering admin and user roles. Used by session-related hooks and providers.",
  "frontend/src/state/session/useSession.ts": "Convenience hook to access the SessionContext and enforce usage within SessionProvider. Returns session state and auth actions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color mappings to CSS variables, animations, fonts, and plugins. Enables dark mode, container settings, and shared design tokens.",
  "project_state.json": "Metadata file describing the project’s overall goals, current feature set, and requirements for the worker accounting web app. Used to track design, UX, and functional roadmap state."
}