{
  "backend/main.mo": "Motoko actor combining storage, access control, approval flows, profiles, and user blocking with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs with confidence scores.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of various frontend files for quick reference.",
  "frontend/DEPLOY_RETRY_RUNBOOK.md": "Runbook describing how to retry deployments, what to monitor, and common causes of transient build failures.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React root and loading the main TSX module.",
  "frontend/src/App.tsx": "Main React app component handling session state, block checks, view routing, and storage migrations.",
  "frontend/src/components/dashboard/ActionTile.tsx": "Reusable action tile component with gradient backgrounds, size variants, and icon/label display.",
  "frontend/src/components/dashboard/dashboardBorders.ts": "Centralized Tailwind class constants for consistent dashboard border, padding, and layout styling.",
  "frontend/src/components/feedback/ConfirmDialog.tsx": "A customizable confirmation dialog using AlertDialog components with confirm/cancel handlers and styling variants.",
  "frontend/src/components/feedback/notify.ts": "A small wrapper around sonner toast to show success, error, and info notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, branding, scroll effects, logout handling, and MT‑Loan prompt support.",
  "frontend/src/components/layout/BottomSheet.tsx": "A bottom sheet modal with backdrop, scroll locking, and a close button.",
  "frontend/src/components/layout/DashboardFooter.tsx": "A three‑button footer bar for dashboard actions with icons and gradients.",
  "frontend/src/components/layout/DashboardFrame.tsx": "A centered mobile-style frame wrapping dashboard content with fixed viewport height.",
  "frontend/src/components/layout/PopupModal.tsx": "A fullscreen modal with backdrop, scroll lock, close button, and scrollable content area.",
  "frontend/src/features/admin/AdminPanel.tsx": "Controls admin navigation across multiple sections and displays MT‑Loan password prompt.",
  "frontend/src/features/admin/components/AdminBottomNav.tsx": "Bottom navigation bar for admin views with icons and active-state styling.",
  "frontend/src/features/admin/components/AdminGridMenu.tsx": "Grid of action tiles for navigating admin sections, using dynamic labels and icons.",
  "frontend/src/features/admin/components/AdminHeaderAvatar.tsx": "Renders the admin avatar, loading from profile photo, branding logo, or a fallback, and updates on storage or photo changes.",
  "frontend/src/features/admin/components/AdminLayoutShell.tsx": "Provides the admin layout with a dynamic header, title, navigation controls, and bottom navigation wrapper.",
  "frontend/src/features/admin/components/adminNavTypes.ts": "Defines admin view types, nav item structure, and the full list of navigation items with labels and icons.",
  "frontend/src/features/admin/components/AdminSummaryCards.tsx": "Loads account totals from storage and displays income, expense, and due summary KPI cards.",
  "frontend/src/features/admin/sections/ApprovalsSection.tsx": "Displays pending user requests and allows approving or rejecting them with storage updates and confirmation prompts.",
  "frontend/src/features/admin/sections/BlockUsersSection.tsx": "Loads approved users from backend and enables searching, blocking, and unblocking with confirmation and status refresh.",
  "frontend/src/features/admin/sections/CompanyReportSection.tsx": "Manages company payment entries, allowing adding, listing, totaling, and deleting reports with confirmation flows.",
  "frontend/src/features/admin/sections/FinalBalanceSection.tsx": "Loads workers and account balances from storage and displays each worker’s bill, cost, and remaining balance in a table.",
  "frontend/src/features/admin/sections/NastaSection.tsx": "Manages snack expense entries, splitting costs among selected workers, updating their accounts, and listing editable history entries.",
  "frontend/src/features/admin/sections/PaymentLoanSection.tsx": "Handles payment/loan entries shared across workers, updates their individual accounts, and shows a sortable history list.",
  "frontend/src/features/admin/sections/ProductionSection.tsx": "Records production quantities and rates for workers, stores entries in history, and displays a deletable production log.",
  "frontend/src/features/admin/sections/SettingsSection.tsx": "Simple wrapper that renders the system settings panel.",
  "frontend/src/features/admin/sections/SystemSettingsSection.tsx": "Provides tabs for labels, layout, branding, backups, user sharing, profile photo, and MT Loan settings, with full save/load logic.",
  "frontend/src/features/admin/sections/UserRequestsSection.tsx": "Displays user approval and blocking sections in a combined layout.",
  "frontend/src/features/admin/sections/WorkerRateSettingsSection.tsx": "Manages worker rate settings including adding, deleting, editing rates, locking, and selecting workers with storage persistence.",
  "frontend/src/features/admin/sections/WorkSection.tsx": "Creates work entries using worker-specific rates, calculates totals per worker, saves history, and displays past entries.",
  "frontend/src/features/auth/BlockedAccountView.tsx": "Displays a blocked account message with a logout button.",
  "frontend/src/features/auth/LoginView.tsx": "Provides a branded login form with validation and session-based authentication.",
  "frontend/src/features/auth/RegisterView.tsx": "Handles user registration, validation, pending request storage, and confirmation flow.",
  "frontend/src/features/mt-loan/MtLoanPasswordPrompt.tsx": "Shows a password dialog for MT Loan access, validating credentials and setting authorization.",
  "frontend/src/features/mt-loan/UserPanelLayoutSkeleton.tsx": "Placeholder component for a future MT Loan user panel; currently returns null.",
  "frontend/src/features/support/SupportView.tsx": "Implements a support messaging interface for users and admins with thread management and message sending.",
  "frontend/src/features/user/components/ClockCard.tsx": "Displays a live-updating clock with formatted time and date.",
  "frontend/src/features/user/components/SelectedWorkersTotalReportSheet.tsx": "Bottom sheet showing totals for selected workers based on stored account data.",
  "frontend/src/features/user/components/UserKpiSummary.tsx": "Renders KPI summary cards for due amount, total work, and total cost.",
  "frontend/src/features/user/payment/NastaHistoryView.tsx": "Loads and displays the user's nasta expense history with per‑head totals.",
  "frontend/src/features/user/payment/PaymentHistoryView.tsx": "Shows the user's loan/payment history filtered from stored histories.",
  "frontend/src/features/user/production/productionAggregates.ts": "Aggregates normalized production history by worker, summing double, single, and earnings totals.",
  "frontend/src/features/user/production/ProductionHistoryView.tsx": "Displays production history with summary totals and a detailed table of entries.",
  "frontend/src/features/user/production/workerNameFormat.ts": "Normalizes worker name fields, returning the best available name array or a fallback.",
  "frontend/src/features/user/profile/ProfileSettingsView.tsx": "Profile settings UI that lets a logged‑in user change their stored password and view profile details.",
  "frontend/src/features/user/UserDashboard.tsx": "Main user dashboard component managing view modes and loading KPI data from storage.",
  "frontend/src/features/user/work/WorkEntryActionSheet.tsx": "Modal showing detailed info for a single work entry and the current user's earnings.",
  "frontend/src/features/user/work/WorkHistoryView.tsx": "Displays a user‑filtered list of work entries with totals and an option to view entry details.",
  "frontend/src/features/work/workAmount.ts": "Computes per‑user and group totals for work entries using new, legacy, or fallback rate data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBranding.ts": "Loads and updates branding settings, subscribing to branding update events.",
  "frontend/src/hooks/useDashboardOverrides.ts": "Loads dashboard override settings and provides lookup helpers, updating on custom events.",
  "frontend/src/hooks/useHashRoute.ts": "Simple hash‑based routing hook that tracks and updates the window location hash.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login flow, and stored identity restoration via React context.",
  "frontend/src/hooks/useSingleConfirmSubmit.ts": "Manages a single‑confirmation submit flow with duplicate‑submit prevention.",
  "frontend/src/hooks/useUserNotice.ts": "Custom React hook that loads notice config and updates state when a notice-config-updated event is dispatched.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, gradients, and utility classes.",
  "frontend/src/lib/branding/brandingStorage.ts": "Manages branding settings in localStorage and provides helpers for accessing logo URLs.",
  "frontend/src/lib/storage/adminCredentialsStorage.ts": "Handles storing, loading, and validating admin credentials with simple localStorage utilities.",
  "frontend/src/lib/storage/adminDashboardLayoutRulesStorage.ts": "Manages dashboard layout rules in localStorage, including loading, saving, and updating section layout configs.",
  "frontend/src/lib/storage/adminSelectedWorkersStorage.ts": "Stores and manages selected worker names for reports, including toggling and cleanup functions.",
  "frontend/src/lib/storage/adminTotalsStorage.ts": "Saves and loads admin total metrics such as taken, work, and due amounts from localStorage.",
  "frontend/src/lib/storage/backupRestore.ts": "Exports selected app data to a JSON backup and restores it by importing and writing keys back to storage.",
  "frontend/src/lib/storage/companyReportStorage.ts": "Manages company payment report entries, supports legacy normalization, and computes total work earned.",
  "frontend/src/lib/storage/customSectionsStorage.ts": "Loads and saves custom dashboard section definitions in localStorage.",
  "frontend/src/lib/storage/dashboardOverridesStorage.ts": "Handles customizable dashboard label overrides and dispatches update events on save or reset.",
  "frontend/src/lib/storage/labelSettingsStorage.ts": "Manages label entries with ordering and overrides, merging defaults and saving updates to localStorage.",
  "frontend/src/lib/storage/mtLoanAuthStorage.ts": "Stores and checks MT loan authorization status in sessionStorage.",
  "frontend/src/lib/storage/mtLoanIdentityStorage.ts": "Creates, retrieves, and clears MT loan identity data using safe storage wrappers.",
  "frontend/src/lib/storage/mtLoanSettingsStorage.ts": "Handles loading, saving, and validating MT loan settings using safe localStorage access.",
  "frontend/src/lib/storage/noticeStorage.ts": "Stores and retrieves user notice configuration with error handling and update events.",
  "frontend/src/lib/storage/productionHistoryStorage.ts": "Loads, normalizes, and saves production history entries ensuring consistent structure.",
  "frontend/src/lib/storage/safeStorage.ts": "Provides safe localStorage helpers with event dispatching and array normalization utilities.",
  "frontend/src/lib/storage/storageSchema.ts": "Runs versioned storage migrations to normalize data structures and update legacy keys.",
  "frontend/src/lib/storage/supportMessagingStorage.ts": "Manages support message threads, adding messages and retrieving thread data from localStorage.",
  "frontend/src/lib/storage/userIdStorage.ts": "Assigns and persists stable numeric user IDs for approved users with migration handling.",
  "frontend/src/lib/storage/userProfileStorage.ts": "Manages profile photos for users and admin, including saving, retrieving, and removal with events.",
  "frontend/src/lib/storage/userSharingSettingsStorage.ts": "Loads and saves user sharing settings with defaults and update event dispatching.",
  "frontend/src/lib/storage/workerRatesStorage.ts": "Handles worker rate loading, saving, migration, and lock state management with legacy support.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/state/session/SessionProvider.tsx": "Provides session context, restores session from storage, handles admin/user login, logout, and profile updates with local persistence and query cache clearing.",
  "frontend/src/state/session/sessionTypes.ts": "Defines TypeScript interfaces for session data, login results, profile updates, and user records.",
  "frontend/src/state/session/useSession.ts": "Exposes a hook to access the SessionContext and ensures it is used within a provider.",
  "frontend/src/utils/moneySplit.ts": "Provides utilities for equal money splitting and deriving per-head amounts with consistent rounding.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theming, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes current project state, requested features, and architectural notes for MT Loan access control and UI additions."
}