{
  "kind": "build_request",
  "title": "Update admin navigation bar (remove Settings, enlarge buttons with borders), restore logout buttons, and remove incorrect time-area labels",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the “Settings” item from the newly added admin navigation bar (the fixed bottom navigation) while keeping the Settings view/section accessible elsewhere (e.g., from the admin dashboard grid menu).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "নতুন জেনেভিশন পার্টি এড হয়েছে সেটি থেকে বাদ দিয়ে",
          "এই নেভিগেশন বার থেকে সেটিং সেকশনটা বাদ দিয়ে দাও"
        ]
      },
      "acceptanceCriteria": [
        "In the admin panel bottom navigation (frontend/src/features/admin/components/AdminBottomNav.tsx), there is no button/tab labeled “সেটিংস” and no nav item with id 'settings'.",
        "Admin Settings (SystemSettingsSection) remains reachable via an existing entry point (e.g., AdminGridMenu tile continues to navigate to 'settings').",
        "No runtime TypeScript errors occur due to removing the 'settings' nav item (e.g., grid column counts and active state logic remain valid)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Increase the size of the remaining buttons in the newly added admin bottom navigation bar and add a visible border around each button; also increase the overall navigation bar height to better match the larger buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "বাটন গুলার একটু বড় করো চারপাশে বর্ডার দিয়ে দিবে"
        ]
      },
      "acceptanceCriteria": [
        "Admin bottom navigation buttons have noticeably larger tap targets (increased padding/min-height) compared to the current implementation.",
        "Each admin bottom navigation button has a clear border in both active and inactive states.",
        "The admin bottom navigation container provides enough vertical space so labels/icons do not look cramped or clipped on common mobile widths."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a visible Logout option in both the Admin panel and the User panel. In the Admin panel header, restore the previous Logout button behavior and remove the newly added header button that replaced it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "এডমিন প্যানেল ইউজার প্যানেল কোন জায়গায় লগ আউট অপশন নেই",
          "এডমিন প্যানেলের হেডারে যে লবণ বাটনটা ছিল ওই লগ আউট বাটনটা ব্যাক আসবে নতুন বাটনটা সরে যাবে"
        ]
      },
      "acceptanceCriteria": [
        "Admin panel header (frontend/src/features/admin/components/AdminLayoutShell.tsx) includes a Logout control that logs the admin out (clears session) and returns the app to the logged-out state.",
        "User dashboard header (frontend/src/features/user/UserDashboard.tsx) includes a Logout control that logs the user out (clears session) and returns the app to the logged-out state.",
        "The admin header’s newly added replacement button is removed from the header area as requested, and the restored Logout control is present instead.",
        "Logging out clears cached UI state where applicable (e.g., session removed from localStorage and React Query cache cleared via existing SessionProvider logic)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the incorrect text that appears near the time display (e.g., “MT Loan” / “HMT”) so that the time area only shows the clock time/date and does not show unrelated labels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "১১:০০ টার জায়গায় এম টি লোন এইচএমটি এলো না এখানে থাকবে না"
        ]
      },
      "acceptanceCriteria": [
        "No UI region intended to show the current time (e.g., the ClockCard in frontend/src/features/user/components/ClockCard.tsx and its surrounding layout) displays strings like “MT-LOAN”, “MT Loan”, or “HMT”.",
        "The clock component continues to show a live-updating time and date without extra, unrelated labels.",
        "The fix does not remove MT Loan functionality elsewhere (only removes the incorrect/stray label from the time area)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not modify files listed as immutable paths in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Do not redesign unrelated screens or change overall branding/theme beyond the requested navigation/button adjustments.",
    "Do not remove the Settings feature itself—only remove its entry from the specified new navigation bar.",
    "Do not add new authentication providers; use the existing session/logout mechanisms already present in the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}