{
  "kind": "build_request",
  "title": "Update Admin Production form (double/single quantity & rate) and fix User Dashboard typography/mobile fit",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Admin Panel \u001eProduction\u001f section form to capture separate work quantities for Double and Single, and separate rates for Double and Single (4 inputs total: quantityDouble, quantitySingle, rateDouble, rateSingle), matching the user-requested layout: quantities first, then rates below.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "এডমিন প্যানেলে কাজের পরিমাণ অংশে দুটি ইনপুট ডাবল সিঙ্গেল তার নিচে ডাবল এর রেট সিঙ্গেলের রেট আরো দুইটিন ফুটবল বক্স"
        ]
      },
      "acceptanceCriteria": [
        "Admin > Production form shows two numeric inputs for quantities (Double, Single).",
        "Directly under the quantity inputs, the form shows two numeric inputs for rates (Double rate, Single rate).",
        "Form validation prevents submit when any required field is missing or invalid (non-numeric/negative)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update Admin Panel \u001eProduction\u001f calculations and persisted history so totals are computed from the new fields: total = (quantityDouble * rateDouble) + (quantitySingle * rateSingle), and the stored history record includes these four fields plus computed totals.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "শুধু ‘কাজের পরিমাণ’ অংশে দুটি নতুন ইনপুট (ডাবল ও সিঙ্গেল) যোগ করব"
        ]
      },
      "acceptanceCriteria": [
        "Submitting a production entry stores a history object that includes quantityDouble, quantitySingle, rateDouble, rateSingle, and computed total.",
        "The worker account bill updates by the computed total for each selected worker, consistent with existing accounting behavior.",
        "The Admin Production history table is updated to display the new Double/Single quantities and rates, and shows the computed total.",
        "Deleting a production entry reverses the correct computed total from worker accounts and removes the history entry."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the User Panel \u001eProduction History\u001f view to show a list of all employees (workers) and display each worker\u0019s Double and Single information derived from the Admin Production history data, instead of only filtering to the logged-in user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ইউজার প্যানেলে প্রোডাকশন হিস্ট্রি অপশন এর ভিতর ঢুকলে সব কর্মীদের নাম দেখাবে ডাবল সিঙ্গেল শো করবে"
        ]
      },
      "acceptanceCriteria": [
        "User > Production History displays all worker names (not only the logged-in user).",
        "For each worker, the view shows Double and Single quantities (and corresponding totals or earnings) computed from stored production history entries.",
        "If there is no production history for a worker, the UI clearly indicates 0 / no records for that worker without errors.",
        "The view renders without relying on the legacy `histories.boardWork` shape for production data."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Increase the font size of the four User Dashboard section tiles (Production, Snacks, Payment/Loan, Work) so the section titles are visibly larger and easier to read on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "প্রোডাকশন নাস্তা পেমেন্ট লোন এই চারটি সেকশনের টাইটেলের ফ্রন্টগুলা বড় করে দাও"
        ]
      },
      "acceptanceCriteria": [
        "The labels on the four main user dashboard tiles are rendered with a larger font size than the current \u0018small\u0019 variant.",
        "No label text is clipped or overlaps icons on common mobile widths (e.g., 360px)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Fix User Panel typography and mobile layout so content fits within the phone viewport without being cut off at the bottom: reduce excessive spacing/padding in the User Dashboard layout while keeping readability, and ensure scroll + fixed footer behavior does not hide content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ইউজার প্যানেলের সব জায়গায় ফ্রন্টগুলো ছোট হয়ে গেছে",
          "ফাঁকা জায়গা গুলা একটু কমিয়ে স্ক্রিনটা একটু ছোট করো কেন স্ক্রিনের ভিতরেই থাকে যেন স্ক্রিনের বাইরে না যায়"
        ]
      },
      "acceptanceCriteria": [
        "User dashboard text (header meta labels, KPI section, and main content) is increased to a readable size relative to current rendering.",
        "On mobile-sized viewports, the bottom content is not hidden behind the fixed footer; users can scroll to see all content.",
        "No main content overflows outside the DashboardFrame container; the UI remains fully usable without elements being cut off."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in this build request (code/UI language can remain unchanged).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose instead).",
    "Keep the backend as a single Motoko actor; do not add additional backend services."
  ],
  "nonGoals": [
    "Investigating or resolving the prior production deployment error (not requested in the latest build instruction).",
    "Adding new authentication providers (only Internet Identity is supported).",
    "Introducing external databases or backend persistence for these UI changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}