{
  "kind": "build_request",
  "title": "Admin panel UI polish: settings tabs container, dropdown readability, KPI display cards, confirmation dialog style, header avatar, and footer button placement",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enlarge the main white content card under the Settings tabs (increase effective width on mobile/desktop and increase vertical spacing), and visually group the Settings tab buttons inside a clearer rounded, bordered container so the tabs feel placed “inside the box”. Apply this to the Settings view rendered by AdminLayoutShell + SystemSettingsSection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-6",
          "recent-12"
        ],
        "quotes": [
          "লেবেল লেআউট ব্র্যান্ডিং শেয়ারিং ব্যাকআপ এগুলা নিচে ... বক্সটা একটু বড় করে",
          "১/উপরে থাকা ট্যাব সেকশনের নিচে যে বড় সাদা কার্ড আছে সেটা? ২/উচ্চতা বাড়ানো, প্রস্থ বাড়ানো",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "On the System Settings screen, the white content card is noticeably wider (reduced side margins) and taller (more internal padding/spacing), especially on mobile.",
        "The tabs (Labels/Layout/Branding/Sharing/Backup) are contained within a rounded bordered container that looks intentional; active/inactive states remain clear.",
        "No content is clipped/overlapped by the fixed header or fixed footer on common mobile sizes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix Select/dropdown readability in Settings so that when the dropdown opens, option text is not blurry/cut off and the dropdown panel positions and stacks correctly above surrounding cards. Ensure consistent font size, line height, and adequate padding for SelectTrigger/SelectContent in SystemSettingsSection (and any similar Select usage in admin settings).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-2",
          "recent-8",
          "recent-12"
        ],
        "quotes": [
          "এখানে ক্লিক করলে আসলে কি লেখা আসছে",
          "ক্লিক করলে ভিতরে কি লেখা আছে বোঝা যায় না",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "Opening a dropdown shows all options fully (no clipping), with readable contrast and font sizing.",
        "Dropdown content overlays above nearby cards/containers correctly (no being hidden behind other elements).",
        "The selected value inside the trigger remains readable on both light and gradient backgrounds."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve the visibility/contrast of the \"Worker & Rate Settings\" section title and restyle all input boxes in that section to match the lighter, cleaner input style used elsewhere (consistent background shade, border, focus ring). Apply to WorkerRateSettingsSection inputs (new worker name, rate inputs) and any Settings inputs that currently look washed out.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-6",
          "recent-12"
        ],
        "quotes": [
          "২/কর্মী ও রেট সেটিংস একটা টাইটেলটা দেখা যাচ্ছে না ... ইনপুটের বক্স আছে ... ওগুলার মত একটু হালকা সেডা দিয়ে",
          "১/উপরে থাকা ট্যাব সেকশনের নিচে ... ৩/...",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "The \"কর্মী ও রেট সেটিংস\" title has clear contrast against its header background and is readable on mobile.",
        "All inputs in WorkerRateSettingsSection have a consistent light background shade, consistent border thickness, and consistent focus state.",
        "Disabled/locked inputs remain visually distinct but still readable."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an admin header profile avatar to the right side of the AdminLayoutShell header. The avatar should display a stored profile photo when available (reuse existing profile photo storage approach); otherwise show a default placeholder avatar image. Ensure it fits in the header without breaking title/back button layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-12"
        ],
        "quotes": [
          "৩/admun প্যানেলের হেডারে প্রোফাইল পিক এড করবে",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "Admin header shows a circular avatar on the right side on all admin screens using AdminLayoutShell.",
        "If a profile photo exists for the current user/admin identity, it is displayed; otherwise a placeholder avatar is shown.",
        "Header layout remains stable: title truncates gracefully and the avatar does not overlap buttons/text."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Reposition/restyle the bottom fixed action buttons (MT-LOAN / Support / Calculator) so they appear visually clean “above/on top of” the content card without obscuring content. Ensure adequate bottom spacing in scrollable content, and adjust footer container styling (rounded floating bar look, consistent shadow/border) if needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-12"
        ],
        "quotes": [
          "৪/নিচে প্রটারে বাটন গুলার ... কার্ড টার উপরে বাটন গুলো সুন্দর দেখা যায়",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "The footer does not cover important content at the bottom of pages; last form controls remain accessible without being hidden.",
        "Footer buttons look intentionally placed (consistent spacing, rounded container, readable labels) and do not clash with underlying card borders.",
        "Behavior remains fixed/sticky at bottom during scroll."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Redesign the top 3 admin money summary cards so the numeric readout does not show an ugly white patch behind the text. Replace the current inner white/opaque block style with a cleaner “display/screen” readout look (high contrast, no harsh white rectangle, consistent across all three cards).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-12"
        ],
        "quotes": [
          "প্যানেলের উপরে যে টাকা দেখানোর তিনটা কার্ড আছে ... লেখার মাঝখানে সাদা আছে দেখতে খারাপ দেখা যায় ... ডিসপ্লের মত থাকবে",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "In AdminSummaryCards, the number area no longer appears as a stark white patch; it reads like a cohesive display element.",
        "Text remains highly readable in all three cards (Due/Work/Taken) on mobile.",
        "Borders/radius/shadow remain consistent with the dashboard style constants where applicable."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update confirmation dialog UI to a round-shaped, colorful (Bangladesh-style vibrant) look while maintaining readability. Apply to the shared ConfirmDialog component so admin confirmations (e.g., delete worker, logout confirm usage where applicable) have improved visual appeal and clear button hierarchy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-9",
          "recent-10",
          "recent-12"
        ],
        "quotes": [
          "কনফার্মেশন যে মেসেজটা আছে দেখা যায় ... বিডি কালারফুল থাকবে",
          "রাহুল বলিনি বলছি রাউন্ড শেপ",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "ConfirmDialog has noticeably rounder corners and a more colorful, polished header/body styling while keeping text readable.",
        "Primary/confirm and cancel buttons are clearly distinguished and remain at least 44px tall for touch.",
        "Dialog content is centered and not clipped on mobile; overlay stacking remains correct."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add the generated default avatar placeholder image as a static asset and wire it into the admin header avatar fallback (do not serve it from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-6",
          "recent-12"
        ],
        "quotes": [
          "৩/admun প্যানেলের হেডারে প্রোফাইল পিক এড করবে",
          "\"বিল্ড কর\""
        ]
      },
      "acceptanceCriteria": [
        "The placeholder avatar file exists under frontend/public/assets/generated and is referenced directly by the frontend for fallback rendering.",
        "No backend endpoints are added for serving images."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Keep the backend single-actor architecture unchanged; UI polish should not require backend changes."
  ],
  "nonGoals": [
    "Implementing MT-LOAN, Support chat, or Calculator features beyond existing placeholder/toast behavior.",
    "Adding third-party authentication providers or external databases/services.",
    "Changing core storage schema unless strictly required for the visual fixes above."
  ],
  "imageRequirements": {
    "required": [
      "Default round avatar placeholder illustration (admin-avatar-placeholder.dim_128x128.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}