{
  "kind": "build_request",
  "title": "User panel UI fixes: highlight username, fit dashboard tiles on-screen, and add color styling to registration form",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the User Dashboard header so the logged-in user name is visually prominent (larger size + attractive designer-chosen coloring/gradient) and does not appear as plain white text. Keep the header showing both the numeric user ID and the user name, and apply the styling consistently for any user (including the example user OPU, id=1).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "১/হেডারেও ইউযারের নামটা এভাবে আসবে না ... নামটা যেন কালারিং হয় বড় দেখা যায়",
          "OPU id:1"
        ]
      },
      "acceptanceCriteria": [
        "On the user dashboard header, the user name is noticeably larger than before and uses a clear colored/gradient styling (not plain white-only).",
        "The header still shows both “User: <id>” and the user name.",
        "No layout overlap occurs in the header at common mobile widths (e.g., 360px)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the User Dashboard main (dashboard) layout so the four action tiles (Production, Payment/Loan, Work, Snack) and the clock card fit within the viewport without the tiles overflowing outside the screen. Reduce the visual size of the tiles (card padding/icon/text/aspect where needed) and make the clock card slightly smaller so the dashboard content fits on-screen without requiring vertical scrolling to reach the tiles on common mobile devices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "২/ইউজার ফেনেলের সেকশন গুলা বড় হয়ে গেছে ... এগুলা স্ক্রিনের ভিতরেই থাকবে যেন স্লইট করতে না হয়",
          "কার্ডগুলো একটু ছোট করে দিলেই উপরে ঘড়িটা একটু ছোট করলেই স্কিনের ভিতরে ফিট হয়ে যাবে"
        ]
      },
      "acceptanceCriteria": [
        "At a typical mobile viewport (e.g., 360x800), the dashboard shows the notice (if enabled), clock, KPI summary, and the 2x2 tile grid without tiles rendering outside the frame/container.",
        "The tile grid remains fully visible within the dashboard frame without horizontal overflow.",
        "The clock card is slightly reduced in height/typography compared to current, while remaining readable.",
        "No new scrolling/overlap regressions are introduced with the fixed header and fixed footer present."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restyle the new user registration form (RegisterView) so it has a clear, attractive color theme (designer choice) rather than appearing uncolored/plain. Apply cohesive colors to the registration card background, form fields (borders/focus), headings, and primary submit button while keeping readability and contrast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "৩/নতুন রেজিস্ট্রেশন অপশনে ক্লিক করলে যে ফর্মটা আসে ... ডিজাইনটাতে কোন কালার নেই ওই ফর্মটা কালার করে দিও",
          "৩/তোমার মন মতো দিয়ে দাও"
        ]
      },
      "acceptanceCriteria": [
        "The registration screen uses a cohesive, visually distinct color theme (background + card + inputs + button) rather than mostly neutral/unstyled colors.",
        "Text remains readable with sufficient contrast in both light conditions and on mobile.",
        "Form behavior (validation, pending request storage, success messaging, switching back to login) remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui) must not be edited.",
    "Keep all changes limited to UI/styling/layout; do not change backend data models or workflows for login/registration/approvals."
  ],
  "nonGoals": [
    "Do not add new features to the admin panel or change admin behavior.",
    "Do not introduce new authentication methods beyond the existing flow.",
    "Do not change the language/content of existing Bangla labels unless required for layout (styling changes only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}