{
  "kind": "build_request",
  "title": "Admin dashboard UI update: large circular top 3 buttons + full-width bordered group for 3 money buttons",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Admin dashboard top summary area to match the uploaded screenshot: render the 3 summary items (Total Work/Total Taken/Total Due) as large circular buttons in a single row that spans the full available screen width, with consistent spacing and clear icon/label/value layout inside each circle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "এগুলোকে পুরো স্ক্রিন জুড়ে বড় আকারে দেখাতে চান?",
          "এখানে সার্কের  তুমি দিবে  রাউন্ড শেপ"
        ]
      },
      "acceptanceCriteria": [
        "On the Admin dashboard view, the top 3 summary actions are displayed as circles (not rounded rectangles) using fully round shape styling (e.g., fully-rounded).",
        "The 3 circles appear in one horizontal row and collectively span the available content width (responsive on mobile).",
        "Each circle shows its label and numeric value clearly; existing summary values remain correct (no logic changes to calculations).",
        "The rest of the Admin dashboard layout below the top summary area remains functional and scrolls as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Group the next 3 money-related Admin grid buttons (Payment/Loan, Company Report, Final Balance) inside a single full-width bordered container (one border surrounding all three), while keeping the individual button design consistent with the screenshot (same tile look, rounded corners, shadows).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "বাটন (যেগুলো টাকা‑সম্পর্কিত) একসাথে একটি বড় বর্ডারের ভিতরে ফুল‑স্ক্রিন চওড়ায় রাখতে হবে?",
          "আরো পরের তিনটা বাটন ওগুলা একটা বর্ডারের ভিতর থাকবে ফুল স্ক্রিন"
        ]
      },
      "acceptanceCriteria": [
        "In the Admin dashboard grid menu, the 3 money-related buttons are visually grouped inside one full-width container with a distinct border and rounded corners.",
        "Inside the bordered container, the 3 buttons keep their existing per-button styling (gradient, icon, label, rounded tile shape, shadow) and remain clickable.",
        "Buttons outside this money group (e.g., Production/Work/Nasta and other items) keep the same styling as before and are not unintentionally moved into the border group."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure any UI element intended to be circular in the Admin dashboard (especially the top 3 circles) is perfectly round across devices (no oval distortion), including correct aspect ratio, centered content alignment, and consistent border thickness.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "এখানে সার্কের  তুমি দিবে  রাউন্ড শেপ"
        ]
      },
      "acceptanceCriteria": [
        "Top circular buttons remain perfectly circular (equal width/height) on common mobile widths.",
        "Borders/shadows around circular buttons appear even and not clipped.",
        "Touch/click targets are preserved and do not overlap the fixed header/footer."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui/*).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this UI-only update."
  ],
  "nonGoals": [
    "Do not change Admin dashboard navigation behavior or routes beyond necessary layout restructuring.",
    "Do not introduce new authentication methods or third-party integrations.",
    "Do not redesign non-requested pages/sections (Production, Work, Nasta, Payment, etc.) beyond keeping their entry buttons styled as in the screenshot."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}