{
  "kind": "build_request",
  "title": "Add MT Loan settings + password-gated entry and keep User Panel fully hidden (no design changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new Settings card/section in the currently empty top area of the Settings screen that contains: (1) a Name input, (2) a Password input, and (3) a Save button. Persist the saved Name+Password locally so they remain available after refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8",
          "msg-11"
        ],
        "quotes": [
          "Settings Card / Section থাকবে যার ভেতরে থাকবে:\nনাম সেট করার ইনপুট\nপাসওয়ার্ড সেট করার ইনপুট\nSave বাটন",
          "হ্যাঁ বিট কর আগের যেগুলা বাকি আছে সবগুলা একসাথে কর ডিজাইন পরিবর্তন করো না কোন কিছু ডিজাইন পরিবর্তন করো না"
        ]
      },
      "acceptanceCriteria": [
        "Settings screen shows an additional card/section at the top empty area with Name, Password, and Save controls.",
        "Clicking Save persists the configured Name and Password (survives page refresh).",
        "No other Settings sections/tabs are removed or visually restyled beyond inserting this new card into the existing empty area."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement MT Loan password gating: when the MT-LOAN button is clicked (existing header quick action), show a password prompt modal. If the entered password does not match the admin-saved MT Loan password, block access and show an error message. If it matches, mark the session as authorized for MT Loan and auto-create a user identity using the admin-saved Name (store locally); do not expose the User Panel UI yet (integration/navigation will be done later).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-8",
          "msg-11"
        ],
        "quotes": [
          "Mt loan বাটনে যদি ক্লিক করে তাহলে পাসওয়ার্ড বক্স ওপেন হবে",
          "পাসওয়ার্ড দিয়ে ঢুকতে পারবে অটোমেটিক তার নামে আইডি ক্রিয়েট হয়ে যাবে",
          "এখন আপাতত তুমি সেটিংসে এটা অ্যাড করে পাসওয়ার্ড এর সিস্টেম টা করে রাখ বাদবাকি কাজ পরে করব"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the existing MT-LOAN UI control opens a password prompt modal (not a new page).",
        "Wrong password: no authorization is granted and the UI shows an error feedback.",
        "Correct password: an 'authorized' flag for MT Loan is persisted locally for the current session (or until logout), and a user identity record is created locally using the configured Name.",
        "No User Panel screens/features become visible as a result of successful password entry (only the authorization + identity creation is prepared)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create/keep a User Panel layout skeleton in the codebase, but ensure the entire User Panel is fully hidden/blocked from users for now. Include a logout button placeholder/structure in the hidden User Panel layout so it is ready for later activation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "ইউজার প্যানেলে এখন পুরো প্যানেলটি হাইড/ব্লক রাখা হবে, শুধু লেআউট স্ট্রাকচার তৈরি রাখলেই হবে?",
          "লগ আউট বাটন নেই গঠনটা দিয়ে দিও ব্লক করে ফেল"
        ]
      },
      "acceptanceCriteria": [
        "User Panel route/view remains inaccessible or fully blocked (no interactive user panel content visible to end users).",
        "A User Panel layout structure exists in the code (components/layout) including a logout button placeholder in the structure.",
        "The block/hide behavior is enforced consistently (refreshing the page does not reveal the User Panel)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Do not change any existing UI design or styling while implementing REQ-1 to REQ-3. Only add the new Settings card and the password prompt modal using existing UI primitives and existing styling conventions so the rest of the app remains visually unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "ডিজাইন পরিবর্তন করো না কোন কিছু ডিজাইন পরিবর্তন করো না অনেক কিছু পরিবর্তন হয়ে যায় তুমি"
        ]
      },
      "acceptanceCriteria": [
        "Existing screens (Admin dashboard, Settings tabs, headers/footers, existing buttons) retain their current layout and styling.",
        "Any new UI (Settings card and password prompt) uses existing UI components and does not introduce global theme/color/token changes.",
        "No unrelated copy/text is changed as part of this work."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo); only add migration.mo if state upgrades are required.",
    "Do not change existing design/styling outside of inserting the requested new Settings card and adding the password prompt modal UI."
  ],
  "nonGoals": [
    "Implementing the full MT Loan feature area (screens, calculations, or workflows).",
    "Making the User Panel visible or fully functional now (only skeleton + blocked state).",
    "Adding third-party authentication beyond Internet Identity.",
    "Introducing any external database or non-local persistence mechanism beyond existing app patterns."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}