{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User panel UI styling + mobile-fit dashboard adjustments",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the logged-in username in the User Dashboard header visually prominent with larger sizing and a designer-chosen color/gradient while still showing the numeric user ID.",
      "acceptanceCriteria": [
        "On the user dashboard header, the user name is noticeably larger than before and uses a clear colored/gradient styling (not plain white-only).",
        "The header still shows both “User: <id>” and the user name.",
        "No layout overlap occurs in the header at common mobile widths (e.g., 360px)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Update the fixed header typography/layout to highlight the username (larger font, gradient/colored text treatment instead of plain white), keep “User: <id>” visible, and add overflow-safe behavior (wrapping/truncation) so the header does not overlap at ~360px widths."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust a small reusable utility class for gradient text (e.g., background-clip text + text-transparent pattern) to support consistent username styling in the dashboard header without changing application copy."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reduce dashboard tile and clock card sizing so notice/clock/KPIs/2x2 tiles fit within common mobile viewports without tiles overflowing off-screen.",
      "acceptanceCriteria": [
        "At a typical mobile viewport (e.g., 360x800), the dashboard shows the notice (if enabled), clock, KPI summary, and the 2x2 tile grid without tiles rendering outside the frame/container.",
        "The tile grid remains fully visible within the dashboard frame without horizontal overflow.",
        "The clock card is slightly reduced in height/typography compared to current, while remaining readable.",
        "No new scrolling/overlap regressions are introduced with the fixed header and fixed footer present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/ActionTile.tsx",
          "operation": "modify",
          "description": "Adjust the 'user' (and/or 'small') size variant to be more compact on mobile by reducing padding, icon size, and label typography; also tweak sizing constraints (e.g., aspect/spacing) to prevent overflow while keeping tiles readable."
        },
        {
          "path": "frontend/src/features/user/components/ClockCard.tsx",
          "operation": "modify",
          "description": "Reduce clock card visual footprint (padding, border thickness, time/date font sizes, and overall vertical spacing) while preserving readability to help the dashboard fit on common mobile screens."
        },
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Tune the dashboard layout spacing (content padding, section margins, grid gap, and tile size prop selection) to ensure the 2x2 tile grid stays fully within the viewport/frame without horizontal overflow and with fixed header/footer present."
        },
        {
          "path": "frontend/src/features/user/components/UserKpiSummary.tsx",
          "operation": "modify",
          "description": "Slightly compact KPI card spacing/typography (without changing labels/content) to support the overall goal of fitting notice + clock + KPIs + tiles on typical mobile viewports."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply a cohesive, attractive color theme to the registration form (RegisterView) while keeping all behaviors unchanged.",
      "acceptanceCriteria": [
        "The registration screen uses a cohesive, visually distinct color theme (background + card + inputs + button) rather than mostly neutral/unstyled colors.",
        "Text remains readable with sufficient contrast in both light conditions and on mobile.",
        "Form behavior (validation, pending request storage, success messaging, switching back to login) remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/auth/RegisterView.tsx",
          "operation": "modify",
          "description": "Restyle the registration screen with a cohesive theme: enhance page background, card styling, headings, input borders/focus states, and the primary submit button; keep validation logic and submission flow unchanged. Use the shadcn-ui Card/Input/Button components already present for consistent theming. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust any minimal global utility styles needed to support the new RegisterView color theme (e.g., an auth background or input focus glow utility), ensuring readability/contrast on mobile and avoiding changes to backend workflows."
        }
      ]
    }
  ]
}