{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User/Admin dashboard homepage bordered grouping redesign (match reference layout)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Wrap the three User KPI cards inside a single shared bordered container while keeping KPI values/calculations unchanged and matching the reference styling.",
      "acceptanceCriteria": [
        "On the User dashboard home view, the three KPI cards render together inside one shared container with a visible border and rounded corners (not three independent bordered blocks).",
        "The KPI numbers shown remain unchanged from current behavior (same data source and calculations).",
        "The overall visual style (colors/typography/rounded corners/shadows) remains consistent with the uploaded reference image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/user/components/UserKpiSummary.tsx",
          "operation": "modify",
          "description": "Refactor the KPI markup so the 1-wide + 2-half cards are nested inside one shared, rounded, bordered container; remove/soften per-card outer borders as needed so the grouping reads as a single section; do not change props, value formatting, or any calculations."
        },
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Adjust the KPI section wrapper spacing/margins if needed to match the reference layout after the KPI shared bordered container change, without altering any KPI data loading logic."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Re-layout User dashboard action tiles to 3 tiles in the first row and a single Payment/Loan tile in a second row aligned left, preserving existing navigation behavior and tile styling.",
      "acceptanceCriteria": [
        "User dashboard home action tiles are arranged as 3 tiles in the first row and 1 tile in the second row aligned left (matching the reference screenshot layout).",
        "Each action tile has a rounded container with a visible border and consistent shadow treatment.",
        "Clicking each tile still navigates to the same existing views as before (Production, Work, Payment history views, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Update the action tiles layout from a 2x2 grid to a 3-column first row (Production, Work, Nasta) and a second row with only the Payment/Loan tile aligned to the left; keep the same onClick handlers/viewMode transitions for each tile."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update Admin dashboard top totals area to match the User KPI layout (1 full-width + 2 half-width) inside a single shared bordered container, preserving existing totals calculations.",
      "acceptanceCriteria": [
        "Admin dashboard 'dashboard' view shows the same KPI layout style as the User dashboard (1 wide card + 2 half cards).",
        "The three admin KPI cards are inside one shared bordered container with rounded corners.",
        "Admin totals values remain correct and based on the same underlying stored account data as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminSummaryCards.tsx",
          "operation": "modify",
          "description": "Replace the circular totals UI with the same 1-wide + 2-half KPI card layout used on the User dashboard, wrapped inside a single shared bordered/rounded container; keep the existing totals data source and computations intact (no logic changes)."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Adjust admin dashboard summary area container styling (around AdminSummaryCards) so it visually matches the reference (border emphasis and spacing) after the AdminSummaryCards layout change, without changing navigation or logout behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Reorganize Admin dashboard menu tiles into bordered/rounded visual groups for money-related, work-related, and settings-related actions while keeping all existing navigation destinations unchanged and adding no new views.",
      "acceptanceCriteria": [
        "Admin dashboard menu tiles are grouped into clearly separated visual groups (each group has its own rounded border container).",
        "Existing admin navigation destinations remain unchanged for each tile (Production, Work, Nasta, Payment/Loan, Company Report, Final Balance, Requests, Settings, Worker Rate Settings).",
        "No new routes/views are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminGridMenu.tsx",
          "operation": "modify",
          "description": "Rework the menu rendering to create three clearly separated bordered group containers: (1) work-related tiles (Production, Work, Nasta), (2) money-related tiles (Payment/Loan, Company Report, Final Balance), and (3) settings-related tiles (Requests, Settings, Worker Rate Settings); preserve each tile's onNavigate target and do not introduce any new views."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure consistent outer screen/frame border and per-section/group bordered styling across both User and Admin homepages, matching the reference’s emphasis on bordered sections without functional regressions.",
      "acceptanceCriteria": [
        "Both User and Admin homepages show a clear outer frame border around the main content area.",
        "Each grouped area (KPIs container and action group containers) has a visible border and rounded corners consistent with the reference image.",
        "No functional regressions: login, logout, navigation, and all existing data displays/actions still work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/DashboardFrame.tsx",
          "operation": "modify",
          "description": "Normalize the outer frame border/rounding/shadow tokens (if needed) so the User and Admin home dashboards share the same strong, consistent outer border treatment matching the reference."
        },
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Wrap the User action tiles area inside a single bordered/rounded group container (in addition to per-tile borders) so the dashboard reads as bordered sections like the reference; keep all tile actions and viewMode transitions unchanged."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Ensure the Admin dashboard menu area (AdminGridMenu) is presented as clearly bordered section groups (work/money/settings) with consistent spacing and borders comparable to the User homepage; do not change any navigation targets or introduce new views."
        }
      ]
    }
  ]
}