{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin panel accounting parity + UX polish (production report-only, work earnings, confirmations, header/nav tweaks)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Admin Production report-only: keep saving/deleting production history but stop updating accounts/balances from Production entries.",
      "acceptanceCriteria": [
        "When submitting a new production entry in Admin, the entry is saved to production history as before.",
        "Submitting/deleting a production entry does NOT modify the stored accounts (no bill/cost changes).",
        "Existing production history list/table in Admin still shows all entries correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/ProductionSection.tsx",
          "operation": "modify",
          "description": "Remove all account/balance mutations from Production save/delete flows (stop changing accounts.bill). Keep the existing form validation and productionHistory storage behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Unify User Production report UI/data with Admin Production report (same structure, same production history source).",
      "acceptanceCriteria": [
        "Admin and User Production pages render the same report structure (columns/rows and totals) for the same underlying production history.",
        "No user/account balance changes are introduced on the User Production report page (report display only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/production/ProductionReportTable.tsx",
          "operation": "create",
          "description": "Create a shared, read-only Production report component that renders the same table structure used by Admin Production (date, names, double, single, total) from production history. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/sections/ProductionSection.tsx",
          "operation": "modify",
          "description": "Refactor Admin Production history rendering to use the shared ProductionReportTable for consistent structure with User Production. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/user/production/ProductionHistoryView.tsx",
          "operation": "modify",
          "description": "Update User Production view to render the shared ProductionReportTable using the same productionHistory source (no account mutations; display-only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/user/production/productionAggregates.ts",
          "operation": "modify",
          "description": "Adjust or deprecate production aggregation exports that are no longer used by the User Production report after switching to the shared Admin-format table (keep file compiling; avoid unused exports if linting/build enforces it)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix Work Management accounting: derive amounts from saved worker rates, show grand total, and credit workers as earnings (bill), with reversible deletes.",
      "acceptanceCriteria": [
        "Admin Work entry form has no rate inputs and continues to use saved worker rates (e.g., from worker rate settings).",
        "On submit, the saved WorkHistory entry includes perWorkerAmounts and grandTotal derived from the selected workers’ rates.",
        "Admin Work history table continues to show the grand total for each entry.",
        "Accounts are updated so that each selected worker’s earnings increase (bill increases by that worker’s computed amount) when a work entry is added.",
        "Deleting a Work entry reverses the same earnings effect (bill decreases by that worker’s amount)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/WorkSection.tsx",
          "operation": "modify",
          "description": "Change Work accounting updates to credit earnings to accounts.bill (not accounts.cost) on save, and reverse by decreasing accounts.bill on delete. Keep perWorkerAmounts + grandTotal derived from saved workerRates; add validation/guard for missing rates for selected workers."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure deductions (Nasta, Payment/Loan) reduce net balance by increasing cost, while only Work increases bill (earnings).",
      "acceptanceCriteria": [
        "After adding Work earnings and then adding Nasta/Payment entries for the same worker(s), the worker’s final/remaining balance reflects bill - cost.",
        "No section other than Work increases bill; Nasta/Payment/Loan only affect cost."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/NastaSection.tsx",
          "operation": "modify",
          "description": "Confirm Nasta continues to update accounts.cost only; add any necessary guardrails to prevent accidental bill updates during refactors (no behavior change besides ensuring cost-only)."
        },
        {
          "path": "frontend/src/features/admin/sections/PaymentLoanSection.tsx",
          "operation": "modify",
          "description": "Confirm Payment/Loan continues to update accounts.cost only; add any necessary guardrails to prevent accidental bill updates during refactors (no behavior change besides ensuring cost-only)."
        },
        {
          "path": "frontend/src/features/admin/sections/FinalBalanceSection.tsx",
          "operation": "modify",
          "description": "Verify final/remaining balance presentation remains based on bill - cost and still renders correctly after Work/Production accounting changes (no new persistence)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add single-confirm submit dialogs to Admin Nasta and Admin Payment/Loan, preventing duplicate submits (match Production/Work pattern).",
      "acceptanceCriteria": [
        "Clicking Submit in Admin Nasta shows a confirmation dialog; confirming performs the save; cancelling does not save.",
        "Clicking Submit in Admin Payment/Loan shows a confirmation dialog; confirming performs the save; cancelling does not save.",
        "While saving, the submit action is disabled to prevent double-submits (same pattern as useSingleConfirmSubmit)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/NastaSection.tsx",
          "operation": "modify",
          "description": "Integrate useSingleConfirmSubmit + ConfirmDialog for the submit flow (like Production/Work). Disable the submit button while saving and ensure cancel does not persist."
        },
        {
          "path": "frontend/src/features/admin/sections/PaymentLoanSection.tsx",
          "operation": "modify",
          "description": "Integrate useSingleConfirmSubmit + ConfirmDialog for the submit flow (like Production/Work). Disable the submit button while saving and ensure cancel does not persist."
        },
        {
          "path": "frontend/src/hooks/useSingleConfirmSubmit.ts",
          "operation": "modify",
          "description": "If needed for parity, extend/adjust the hook API to support Nasta/Payment/Loan flows cleanly (e.g., consistent disabled state + confirm open/close handling) without changing immutable auth-related hooks."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Give System Settings tabs distinct, always-visible colors (Label, Total, Layout, Branding) with clear active state.",
      "acceptanceCriteria": [
        "The four System Settings tabs are visually color-distinct from each other.",
        "Active tab state remains clear/accessible (contrast, readable text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/SystemSettingsSection.tsx",
          "operation": "modify",
          "description": "Style the four TabsTrigger buttons with distinct color themes even when inactive, and add accessible active-state styling (e.g., using data-[state=active] classes) so selected tab remains clearly indicated."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If required for consistency, add/adjust small utility classes for tab color variants and active states while preserving existing Tailwind theme variables (no changes to frontend/src/components/ui/*)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add Admin header quick actions: MT-LOAN (left of Support/Chat) and Calculator (right), wired to placeholder interactions.",
      "acceptanceCriteria": [
        "Admin UI shows an “MT-LOAN” button to the left of Support/Chat and a Calculator button to the right.",
        "Both buttons are clickable and trigger a visible placeholder response (modal/sheet/toast) without breaking navigation.",
        "Buttons render correctly on mobile widths (no overlap/clipping)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update the Admin header action area to insert an “MT-LOAN” button immediately left of Support/Chat and a Calculator button immediately right. Wire both to placeholder UI feedback (e.g., notify.info toast or existing modal/sheet). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/feedback/notify.ts",
          "operation": "modify",
          "description": "If needed, add a small helper for consistent placeholder messaging (e.g., info toast text) used by MT-LOAN/Calculator without changing navigation behavior."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Polish Admin header visuals with border/backdrop blur and consistent shadow; keep sticky header stable.",
      "acceptanceCriteria": [
        "Admin header has a visible border separation from the page body.",
        "Header maintains a consistent shadow and does not visually clash with gradient backgrounds.",
        "No layout shift occurs when scrolling (sticky header remains stable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust Admin header container styling to add subtle border and/or backdrop blur with a consistent shadow. Ensure sticky positioning remains stable and does not introduce scroll layout shifts."
        },
        {
          "path": "frontend/src/components/dashboard/dashboardBorders.ts",
          "operation": "modify",
          "description": "If shared border/shadow tokens are used across dashboards, extend/update exported Tailwind class constants so header separation matches the app’s existing visual system."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add a styled bottom container with safe-area padding so bottom nav/buttons don’t clash with phone system navigation.",
      "acceptanceCriteria": [
        "On mobile, the bottom navigation/footer is contained within a clearly styled bar/container with border/separation from the page background.",
        "There is adequate bottom spacing (safe-area aware) so the phone system navigation area does not visually merge with app controls.",
        "No bottom nav items become unreachable or overlapped by the OS navigation area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminBottomNav.tsx",
          "operation": "modify",
          "description": "Wrap fixed bottom navigation in a styled container (border/background/shadow) and add safe-area-aware padding (env(safe-area-inset-bottom)) so controls remain reachable and visually separated from OS navigation."
        },
        {
          "path": "frontend/src/components/layout/DashboardFooter.tsx",
          "operation": "modify",
          "description": "Apply the same safe-area padding + styled bottom container treatment to the footer buttons (Support/Settings) so user-facing bottom controls also avoid OS navigation overlap."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If Tailwind arbitrary env() padding is insufficient in the current setup, add a minimal global utility (e.g., a class that applies padding-bottom using safe-area inset) and reuse it in bottom bars."
        }
      ]
    }
  ]
}