{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "MT Loan settings + password-gated entry with hidden User Panel skeleton (no design changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add MT Loan Name/Password settings card to Settings and persist locally across refresh.",
      "acceptanceCriteria": [
        "Settings screen shows an additional card/section at the top empty area with Name, Password, and Save controls.",
        "Clicking Save persists the configured Name and Password (survives page refresh).",
        "No other Settings sections/tabs are removed or visually restyled beyond inserting this new card into the existing empty area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/storage/mtLoanSettingsStorage.ts",
          "operation": "create",
          "description": "Create local persistence helpers for MT Loan admin-saved Name+Password using existing safe storage patterns (load/save/validate basics)."
        },
        {
          "path": "frontend/src/features/admin/sections/SystemSettingsSection.tsx",
          "operation": "modify",
          "description": "Insert a new top Settings card/section in the currently empty top area that uses existing shadcn-ui primitives (Card/Input/Label/Button) to edit MT Loan Name+Password and Save; wire it to mtLoanSettingsStorage for load-on-mount and save-on-click; show save success/error feedback via existing notify. Use the existing styling conventions in this file; do not restyle existing tabs/sections. Use the shadcn-ui component library already in the project; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Password-gate MT Loan button with a modal prompt; on success persist session authorization and create a local identity record from saved Name without exposing User Panel.",
      "acceptanceCriteria": [
        "Clicking the existing MT-LOAN UI control opens a password prompt modal (not a new page).",
        "Wrong password: no authorization is granted and the UI shows an error feedback.",
        "Correct password: an 'authorized' flag for MT Loan is persisted locally for the current session (or until logout), and a user identity record is created locally using the configured Name.",
        "No User Panel screens/features become visible as a result of successful password entry (only the authorization + identity creation is prepared)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/storage/mtLoanAuthStorage.ts",
          "operation": "create",
          "description": "Create helpers to persist MT Loan authorization for the current session (sessionStorage-based set/get/clear with defensive try/catch), ensuring it does not grant access when absent."
        },
        {
          "path": "frontend/src/lib/storage/mtLoanIdentityStorage.ts",
          "operation": "create",
          "description": "Create helpers to create/read/clear a local MT Loan user identity record (localStorage), populated from the admin-saved MT Loan Name upon successful password entry."
        },
        {
          "path": "frontend/src/features/mt-loan/MtLoanPasswordPrompt.tsx",
          "operation": "create",
          "description": "Create a reusable password prompt modal component that uses existing UI primitives (e.g., shadcn-ui AlertDialog/Dialog + Input/Button) to collect a password, validate it against mtLoanSettingsStorage, show inline error feedback on mismatch, and on success set mtLoanAuthStorage + mtLoanIdentityStorage then close without navigating. Use the shadcn-ui component library already in the project; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Replace the current MT-LOAN click behavior (notify-only) so it opens MtLoanPasswordPrompt modal; ensure all existing MT-LOAN triggers in this file (dashboard footer and AdminLayoutShell left button) route through the same gating behavior. Do not navigate to any User Panel/UI after success. Use the shadcn-ui component library already in the project; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Replace the current MT-LOAN click behavior (notify-only) so it opens the same MtLoanPasswordPrompt modal when AppShell is used, matching the existing header quick action requirement; do not introduce new pages/routes. Use the shadcn-ui component library already in the project; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create a User Panel layout skeleton but keep it fully blocked/hidden; include a logout button placeholder in the layout.",
      "acceptanceCriteria": [
        "User Panel route/view remains inaccessible or fully blocked (no interactive user panel content visible to end users).",
        "A User Panel layout structure exists in the code (components/layout) including a logout button placeholder in the structure.",
        "The block/hide behavior is enforced consistently (refreshing the page does not reveal the User Panel)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/mt-loan/UserPanelLayoutSkeleton.tsx",
          "operation": "create",
          "description": "Add a User Panel layout skeleton component containing the future structure and a logout button placeholder/slot, but ensure it renders a blocked/hidden state by default (e.g., returns null or a non-interactive placeholder) and is not wired into navigation yet so users cannot access it (including after refresh). Use existing UI primitives only; do not introduce new global styling. Use the shadcn-ui component library already in the project; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Preserve existing UI design/styling while adding only the new Settings card and password prompt modal using existing primitives.",
      "acceptanceCriteria": [
        "Existing screens (Admin dashboard, Settings tabs, headers/footers, existing buttons) retain their current layout and styling.",
        "Any new UI (Settings card and password prompt) uses existing UI components and does not introduce global theme/color/token changes.",
        "No unrelated copy/text is changed as part of this work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/SystemSettingsSection.tsx",
          "operation": "modify",
          "description": "Limit changes strictly to inserting the new MT Loan settings card in the top empty area and wiring to storage; avoid modifying existing tab markup, classNames, or copy outside the new card."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Limit changes strictly to swapping MT-LOAN click behavior to open the password prompt modal and adding the modal render; do not alter existing layout/styling or text."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Limit changes strictly to swapping MT-LOAN click behavior to open the password prompt modal and adding the modal render; do not alter existing header/footer styling or text."
        }
      ]
    }
  ]
}