{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin dashboard UI update: circular top summaries and bordered money-button group",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Redesign the Admin dashboard top summary area into three large circular summary buttons spanning the full width with clear internal icon/label/value layout, without changing any calculation logic.",
      "acceptanceCriteria": [
        "On the Admin dashboard view, the top 3 summary actions are displayed as circles (not rounded rectangles) using fully round shape styling (e.g., fully-rounded).",
        "The 3 circles appear in one horizontal row and collectively span the available content width (responsive on mobile).",
        "Each circle shows its label and numeric value clearly; existing summary values remain correct (no logic changes to calculations).",
        "The rest of the Admin dashboard layout below the top summary area remains functional and scrolls as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminSummaryCards.tsx",
          "operation": "modify",
          "description": "Update the summary UI to render the three totals as large circular buttons in a single full-width row; keep existing localStorage reading and total calculations unchanged while improving inner layout (label/value + optional icon) for clarity."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Adjust the dashboard top summary container spacing/padding/sticky behavior as needed so the circular summary row visually spans the available content width and remains aligned under the fixed header without impacting scrolling behavior below."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Visually group the Payment/Loan, Company Report, and Final Balance Admin grid tiles into one full-width bordered container while preserving each tile’s existing styling and click behavior.",
      "acceptanceCriteria": [
        "In the Admin dashboard grid menu, the 3 money-related buttons are visually grouped inside one full-width container with a distinct border and rounded corners.",
        "Inside the bordered container, the 3 buttons keep their existing per-button styling (gradient, icon, label, rounded tile shape, shadow) and remain clickable.",
        "Buttons outside this money group (e.g., Production/Work/Nasta and other items) keep the same styling as before and are not unintentionally moved into the border group."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminGridMenu.tsx",
          "operation": "modify",
          "description": "Restructure the grid rendering so the money-related items (Payment/Loan, Company Report, Final Balance) are rendered inside a single full-width bordered/rounded wrapper (one border around all three) while keeping each button’s existing tile classes and navigation intact."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the Admin dashboard circular UI (especially the top 3 circles) remains perfectly round across devices with consistent borders/shadows and safe touch targets that don’t clash with fixed header/footer.",
      "acceptanceCriteria": [
        "Top circular buttons remain perfectly circular (equal width/height) on common mobile widths.",
        "Borders/shadows around circular buttons appear even and not clipped.",
        "Touch/click targets are preserved and do not overlap the fixed header/footer."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/AdminSummaryCards.tsx",
          "operation": "modify",
          "description": "Enforce a true circle layout using equal width/height sizing (e.g., aspect-square + rounded-full) with centered content, consistent border thickness, and shadows that aren’t clipped on small screens."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Verify/adjust top offsets and bottom padding in the dashboard layout so the circular buttons remain fully visible and tappable under the fixed header and above the fixed footer across common mobile widths."
        }
      ]
    }
  ]
}