{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Production double/single inputs & User Dashboard mobile typography fixes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revise Admin > Production form to capture separate Double/Single quantities and rates with quantities row above rates row, including numeric/non-negative validation.",
      "acceptanceCriteria": [
        "Admin > Production form shows two numeric inputs for quantities (Double, Single).",
        "Directly under the quantity inputs, the form shows two numeric inputs for rates (Double rate, Single rate).",
        "Form validation prevents submit when any required field is missing or invalid (non-numeric/negative)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/ProductionSection.tsx",
          "operation": "modify",
          "description": "Update the Production form UI to use 4 numeric inputs (quantityDouble, quantitySingle, rateDouble, rateSingle) arranged as requested (quantities first row, rates second row). Add client-side validation for required, numeric, and non-negative values; update any modified user-facing strings to English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Admin > Production totals, local persisted history shape, history table display, and delete reversal to use Double/Single quantities and rates.",
      "acceptanceCriteria": [
        "Submitting a production entry stores a history object that includes quantityDouble, quantitySingle, rateDouble, rateSingle, and computed total.",
        "The worker account bill updates by the computed total for each selected worker, consistent with existing accounting behavior.",
        "The Admin Production history table is updated to display the new Double/Single quantities and rates, and shows the computed total.",
        "Deleting a production entry reverses the correct computed total from worker accounts and removes the history entry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/sections/ProductionSection.tsx",
          "operation": "modify",
          "description": "Adjust the ProductionEntry type and persistence in localStorage (productionHistory) to include the 4 new fields plus computed total, and compute total = (quantityDouble*rateDouble)+(quantitySingle*rateSingle). Update history table columns to show Double/Single qty + rates + total, and ensure delete reverses the computed total. Include a safe read/normalization path for any legacy entries so the UI does not crash. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Revise User > Production History to show all workers and their Double/Single totals derived from Admin Production history (not legacy histories.boardWork and not only the logged-in user).",
      "acceptanceCriteria": [
        "User > Production History displays all worker names (not only the logged-in user).",
        "For each worker, the view shows Double and Single quantities (and corresponding totals or earnings) computed from stored production history entries.",
        "If there is no production history for a worker, the UI clearly indicates 0 / no records for that worker without errors.",
        "The view renders without relying on the legacy `histories.boardWork` shape for production data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/user/production/productionAggregates.ts",
          "operation": "create",
          "description": "Add a small aggregation helper that reads normalized productionHistory entries and computes per-worker totals for Double/Single quantities and earnings (and overall total) for display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/user/production/ProductionHistoryView.tsx",
          "operation": "modify",
          "description": "Replace legacy histories.boardWork usage with productionHistory + workers list data, render a list of all workers, and display per-worker Double/Single quantities and earnings computed via the new aggregation helper. Ensure workers with no records display 0 / no records clearly, and update any modified user-facing strings to English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Increase User Dashboard tile title font sizes for Production, Snacks, Payment/Loan, and Work while preventing clipping/overlap on mobile widths.",
      "acceptanceCriteria": [
        "The labels on the four main user dashboard tiles are rendered with a larger font size than the current ‘small’ variant.",
        "No label text is clipped or overlaps icons on common mobile widths (e.g., 360px)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/ActionTile.tsx",
          "operation": "modify",
          "description": "Adjust the 'small' size variant to render a larger label font size (and, if needed, icon size/aspect ratio/gaps) so the four dashboard tiles remain readable without clipping/overlap on ~360px widths. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Improve User Panel typography and mobile layout to prevent bottom cut-off behind fixed footer and reduce excess spacing while keeping readability.",
      "acceptanceCriteria": [
        "User dashboard text (header meta labels, KPI section, and main content) is increased to a readable size relative to current rendering.",
        "On mobile-sized viewports, the bottom content is not hidden behind the fixed footer; users can scroll to see all content.",
        "No main content overflows outside the DashboardFrame container; the UI remains fully usable without elements being cut off."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/DashboardFrame.tsx",
          "operation": "modify",
          "description": "Update the frame sizing to better match mobile viewport behavior (e.g., use a dynamic viewport-height approach) and prevent content being cut off when combined with fixed footer + scrollable content. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/user/UserDashboard.tsx",
          "operation": "modify",
          "description": "Tune user dashboard typography (increase overly-small header meta label sizes and other key text), reduce excessive vertical spacing/padding, and adjust the scroll container bottom padding so content is not hidden behind the fixed DashboardFooter (including safe-area considerations). Keep any modified user-facing strings in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust a small global utility (or extend existing dashboard utilities) to support safe-area bottom padding for fixed-footer layouts so scrolling content isn't obscured on mobile devices. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}